{
  "sections": [
    {
      "section1": [
        {
          "What is cryptocurrency?": "Cryptocurrency is a new kind of internet money. You can use it to buy things online, and you can send it instantly to other users anywhere in the world, at very low cost, needing nothing more than a smartphone and an internet connection.As well as functioning as a new type of internet money, cryptocurrency is also a very popular form of investment, with eye-popping long-term appreciation. When the Bitcoin system launched, its currency, bitcoin, was pretty much worthless. It wasn’t until 2010, when someone paid 10,000 BTC for a couple of pizzas, that bitcoin began to give signs that it could be used as money. But is anyone using it as money? Yes, there are over 1 million active Bitcoin addresses (users) particularly those suffering from the hyperinflation mentioned earlier, which constantly reduces the purchasing power of their existing money and those looking for a strong store of value. (We explain how to measure Bitcoin adoption in a later article).Bitcoin’s design makes it impossible to freeze, seize, spend someone else’s coins, or to spend the same bitcoin twice. If you try to double-spend your coins, only one of the transactions will go through - any others will fail; Hopefully you’ve now understood in basic terms what cryptocurrency is, and how it tries to achieve the function of sound money. As the first cryptocurrency, Bitcoin’s design has opened up a new phase in our journey to find the best sound money, and this is just the start. You’ll discover in later lessons how Bitcoin is evolving and as more people understand it, new improvements and refinements are made. The final frontier for bitcoin is volatility. Even though its price and popularity are increasing, it is still susceptible to big swings in value because in truth Bitcoin is still in its infancy, so congratulations, you are early to the party. But as more and more people own (and use) it, there’s every reason to believe that cryptocurrency will become more stable over time, and prove to be the ultimate form of sound money."
        },
        {
          "Bitcoin, scarcity & trust in money": "In the previous article, you learned the definition and basic characteristics of a cryptocurrency - including the distinction between the money and the money system, and the role of cryptography. You also had a brief intro to the history and evolution of money up until Bitcoin. This should have given you a grasp on how cryptocurrencies - despite being entirely digital - can have value, the origins of the term “gold standard”, and the basic properties of what makes for sound money: durability, divisibility, fungibility, portability, recognisability and scarcity.While all forms of digital currency satisfy the first five reasonably well, it turns out it’s surprisingly hard to impose scarcity on any digital thing. This is crucially important because value comes from scarcity. Imagine if gold was as common as sand, or Da Vinci had produced 1 million exact copies of the Mona Lisa.The absence of digital scarcity is the biggest weakness of existing money; achieving it was arguably the biggest challenge for cryptocurrency. Explaining both, is our challenge here, and it begins by talking about the importance of money holding value.The importance of money holding value - Money is a metre/yardstick for measuring value. This aspect of money is taken for granted by everyone who participates in the economy by using it as a medium of exchange. All trade and economic activity relies on it - it’s like a universal language. And just like when we speak our own language, we don’t often stop and consider it; we just take it for granted. Can you imagine a world where a metre kept constantly changing? Science, engineering and almost all commerce would be impossible.The same goes for economic activity in a world where the value of money doesn’t hold. Even just buying a coffee would require both a lot of maths and a huge amount of risk, let alone more complex stuff like mortgages or insurance. The complexities of modern commerce would be impossible and we'd revert back to the simple credit system mentioned in the first article. Unlike the metre, however, which is a fixed, objective and universally agreed measurement that will never change, money’s value - its measurement - is subjective and therefore changes. The problem of trust in digital money. Money can only be useful (and sound) if the ledgers can be trusted to be accurate and honest, and if its supply is kept under control. This means unreasonable amounts of money won’t suddenly be created or destroyed, with consequential impact on its spending power.  So how do fiat currencies solve this today? Simple: the government manages money the ledger for its currency either directly, by controlling .physical money creation (minting) and managing and allowing the creation of credit/debit relationships between itself, banks and people. To do this the central bank licences a few select institutions (like banks and building societies) to keep ledgers of their own. The sum of the credit of all the records from the ledgers of all the banks of a country (including the central bank) is the total supply of that currency. "
        },
        {
          "How Bitcoin works": "Bitcoin was created by an individual (or group of individuals) who went by the alias of Satoshi Nakamoto. To this day, nobody knows (at least publicly) who Satoshi Nakamoto is - and that’s arguably their biggest legacy to the community. By vanishing into the ether soon after Bitcoin was robust enough, Nakamoto has done away with the first central point of failure. If gold had been “invented” by someone, that person would arguably hold great influence over their invention. If, moreover, that someone had kept a key that allowed them to control the gold economy, they would wield an ungodly amount of power.  They would also be vulnerable to pleas, bribes, legal action, punches in the face, and otherwise strong pressure to tweak their invention to benefit one party or another - perhaps a government, or the mafia. Either way, the entire system would be vulnerable at a central point. That’s not Bitcoin’s case. Also, there’s also no cult of personality around its creator, no one to dictate the rules unchecked. Bitcoin belongs to the world, and no single person or country has jurisdiction over it. Bitcoin's design. Bitcoin is many things, but we’ll focus on the design elements here.Firstly, Bitcoin is a peer-to-peer network of computers all following a set of rules and instructions (the Bitcoin protocol) for validating transactions and issuing new coins. Any computer running any software that respects these rules can participate in the Bitcoin network. These are called Bitcoin Nodes.Think of this protocol as the banking laws of a country. Any bank can operate, so long as they obey the laws. The difference is that the Bitcoin protocol is enforced by code, and not by courts - meaning it’s much more reliable.Second, Bitcoin has a ledger of all the transactions, called the Blockchain. Transactions are recorded in blocks, which are created at set intervals and connect to the previous block to create a chain.Lastly, there is the mechanism for adding blocks to the Blockchain and reaching agreement (consensus mechanism) that the transactions are valid, and the whole chain accurate. This is called Mining. How bitcoin mining works as an incentive. The solution introduced by Bitcoin to this age-old computing problem involves maths, competition, and economic rewards, and goes by the name of mining.Mining involves a competition for solving a complex mathematical problem, which takes on average 10 minutes and is adjusted every two weeks to account for current computing power. The winner gets to add the current block of transactions and receives a reward for their efforts (as we’ll explain below).The catch is, everyone can easily verify that the solution is right. If a miner cheats, all other participants will simply discard the block. A cheater would lose not just the reward, but also all the money spent in energy to mine that block. This combined loss far outweighs any expected profits,"
        },
        {
          "Bitcoin's limitation": "The Trilemma & the future Knowing that Bitcoin has limitations may feel a bit like realising your favourite Super Hero has a weakness, but this was always part of the design. On-chain bitcoin transactions are best suited for high value, infrequent payments; in other words, the Store of Value use case.From previous lessons we know that money must also function as a Medium of Exchange, and that is where solutions to the trilemma come in. With this context now in mind we can delve further into each of the potential solutions - Forks, Lightning Network and Ethereum - and how this relates to the wider cryptocurrency ecosystem with the huge range of coins and services that are emerging. Cryptocurrency fulfills all the characteristics of sound money.Bitcoin was the first, and most influential, cryptocurrency.Its creator was Satoshi Nakamoto - publishing its blueprint in 2008.  How Bitcoin works to achieve a digitally scarce form of money. The achievements of Bitcoin’s creator will likely be considered as important as the invention of the internet or personal computer. Not simply a new form of money, but an entirely new way of thinking about money.As ingenious as the Bitcoin whitepaper was, it wasn’t perfect. This problem is known as the Bitcoin trilemma; how to achieve the three core functions of an ideal cryptocurrency-  Security - Can it provide a secure, trustworthy & reliable monetary system, Scalability - Can it support increasing numbers of users with no compromise on speed or convenience ,Decentralisation - Can it continue to function without a central point of control,Understanding this trilemma will give you a better appreciation of the problems Bitcoin solves, as well as those things it isn’t an ideal solution for. "
        },
        {
          "Crypto's new frontiers": "In any discussion about the future of crypto, it is essential first to understand where the industry is at the current moment in time. There are three aspects to this: the blockchain space is young, moves fast, and interacts with other technologies. Cryptography has been around for a while. Much of the innovation around blockchain  is rooted in the cypherpunk movement of the 1990s. However, we must realise that blockchain was only invented and first applied in 2008/09. That’s only 12/13 years ago. To put this into perspective, the internet’s first application was in the 1970s when academia and military networks began using it to communicate and it took until the early 2000's for widespread usage to really take-off with expanding broadband and mobile penetration. The Spatial Web - Another important factor to consider is how quickly the industry is currently moving., The wider advancements in digital technology and communication, combined with  the nature of blockchain technology, mean the space tends to move incredibly fast. So fast that it can be very hard to keep up. Though blockchains are only a dozen years old, a huge amount has happened in that time. Ethereum and smart contract capability have led to the rise of entirely new industries and many companies - some of which have been legitimate innovators and haven’t. These industries include (and are not limited to) Defi, DAOs, NFTs and Digital identity. To assess the industry’s future, it will be useful to break it down into these key areas of innovation and see where they are likely to be heading.  The third and final important consideration is that the blockchain industry is not operating in a vacuum. Developments in Artificial Intelligence, Augmented and Virtual Reality, Internet of Things (think smart cars, robotics and biometrics), as well as 5G networks, 3d Printing and GPT-3 are all beginning to converge along with the blockchain space. NFTs, Supply Chains & Identity- Non-Fungible-Tokens or NFTs are a specific type of cryptographic token based on blockchain technology. In contrast to Bitcoin or other cryptocurrencies that are fungible - can be freely exchange for other tokens - NFTs represent something unique and are thus not mutually interchangeable. NFTs are used to create digital scarcity and power applications that facilitate the digital trade of art, collectables and other digital items. One famous case is the blockchain-based game ‘crypto kitties’. NFTs represent in-game assets controlled by the user (instead of the developer) and can be traded on third-party marketplaces. NFT collectible platforms are exploding, with individual examples changing hands for eye-watering sums. Banksy recently physically burned a piece of art - called Morons - then created an NFT from the live stream. It sold for $380,000. "
        }
      ]
    },
    {
      "section2": [
        {
          "Earning crypto - risk vs reward?": "To get the most out of this section you’ll need a basic understanding of Bitcoin and how it works. Read this chapter first if you need to get up to speed. Economic incentives are central to how cryptocurrencies can function without a central point of control. The novel use of incentives also extends to how crypto projects attract new users, how those who own cryptocurrency are rewarded for retaining them, and the ways with which you can speculate with, and about the value of, crypto. We’ll use these three measures as yardsticks for you to evaluate the kinds of opportunities out there to earn cryptocurrency, but with the greatest emphasis on measuring risk. As a newcomer, understanding the risks involved, both explicit and implicit, is crucial. You cannot get something for nothing, and any opportunity that seems too good to be true, almost certainly is.  That being said, incentives - where you are compensated in crypto - are one of the main methods crypto projects use to attract new users. This is often simply in exchange for your attention, your time learning about a product or project, as well as promoting to others, the benefits of a new cryptocurrency. These things don’t require any up-front cost but understanding the implied cost of providing personal details, your time and effort - no matter how little - is crucial to realising that there really is no such thing as free cryptocurrency. As you’ll remember, cryptocurrency is a new type of internet money, creating trust and security without a central authority. One of the biggest earning opportunities, but with the greatest risk and complexity, is playing a direct part in running the system..  With Bitcoin, for example, there is no head office, it functions through a dispersed network that anyone can join - called Miners - providing computer power and getting paid bitcoin in return.  We’ll cover that topic last of all, as some of the ideas are complex and involve the greatest investment both in terms of time, money and risk, as well consideration. "
        },
        {
          "Crypto Myths": "If you commute into a city or a big town you’re probably used to being offered tasters of new products such as soft-drinks, shampoo or energy bars. It is a low-cost and effective alternative to online or TV marketing for a completely new product - putting it directly in the hands of a large number of consumers for free, hoping they like it and will buy it in the future. When Bitcoin launched - back in 2009 - it faced an extreme challenge in increasing adoption. It wasn’t just new, it was completely different to existing forms of money, had no company or individual behind it you could review, and no marketing budget. There were no cryptocurrency exchanges - the most popular way adoption grows today - so the only way to buy bitcoin was by sending funds to a miner willing to sell some of the coins they had earned as rewards. This was fine if you were comfortable with the risk of sending money to a stranger, but it was clear that in order to grow, Bitcoin needed an easier incentive system to build up its user base.It shouldn’t therefore be a surprise that attempts to spread the word involved putting bitcoin directly in potential users' hands (virtually speaking) just like the energy bar at a train station; this is how the bitcoin faucet was born. Bitcoin Bubble - While it’s true that some people buy Bitcoin as a speculative investment seeking big returns, that doesn’t mean that Bitcoin itself is a bubble. Bubbles are economic cycles characterized by unsustainable rises in market value. They eventually pop when investors realize prices are much higher than an asset’s fundamental value. Bitcoin is occasionally compared to an infamous early speculative bubble: the 17th century Dutch “tulip mania.” In 1637, speculators caused prices for some tulip varieties to surge 26-fold. The bubble lasted six months, crashed, and never recovered. "
        },
        {
          "Learning & earning": "“Earn crypto while learning about crypto” is the simple slogan of the educational portal from cryptocurrency exchange Coinbase. In return for watching videos and taking quizzes on cryptocurrency projects whose tokens are listed on Coinbase, you can earn a small portion of that token. For example, you can earn $6 of MKR tokens for learning about how Maker works, and an impressive $50 of XLM for learning about Stellar. The table below shows that if you look at all the Learn and Earn courses Coinbase have ever supported and held on to the crypto rewards you have you would have made $460 as of January 18th 2022, with an aggregate price increase for all the coins rewarded of 58%.  Bear in mind that these figures will have come down since the All Time Highs hit by most cryptocurrencies in August 2021 but still show that with patience, you can earn significant sums of crypto over the long run just for learning about new projects. There’s another crypto-friendly company that allows you to earn cryptocurrency, and you may have heard of it: Brave, the web browser that has its own token called BAT. Brave is part of the attention economy which describes people giving their time to engage with content that brands would like them to see. Short for Basic Attention Token, BAT is rewarded to users who provide advertisers with their time by watching ads.  You don’t get paid for watching an advert on YouTube or Facebook, but on Brave it’s different. As Brave explains, when you turn on Brave Rewards within the browser, you can earn “frequent flier-like tokens for viewing privacy-respecting ads. You can set the number of ads you see per hour.Watching ads isn’t most people’s idea of fun, and you’re not going to get rich off watching ads every hour. However, the Brave Rewards program is well designed and integrated into the web browser, and will help you learn about cryptocurrency wallets, and ways to use them, as you browse. The user experience is superior to that provided by bitcoin faucets that also force you to watch ads."
        },
        {
          "Early stage investment": "In the early days of Bitcoin, the concept of “earning” from cryptocurrency was largely confined to mining. Miners – first individuals and later pools – received bitcoin as a reward for committing blocks of verified transactions to the blockchain. Fast-forward to the modern day and there are numerous ways to earn, from staking and trading to selling goods and services in exchange for cryptocurrency. Another way of gaining exposure to digital assets is via ICOs and investment platforms. ICOs – Initial Coin Offerings – are essentially crowdfunds that raise capital for new crypto-related startups. ICOs are crypto’s stripped-down version of the stock market’s IPOs (Initial Public Offering), wherein the shares of a private corporation are offered to the public in a new stock issuance.  In 2017, ICO mania gripped the industry as close to $5 billion was raised from investors queuing up to lay their hands on newly-created tokens. These intrepid investors were evidently hoping that their assets would – like Bitcoin – soar in value. Some did, many didn’t; ultimately the ICO bubble burst as crypto entered a protracted bear market. Investment Platforms Investment platforms offer a means by which investors can gain exposure to crypto companies as a shareholder, rather than simply holding a native cryptocurrency, and benefit from the success of the underlying business. This can make them more appealing to investors who prefer traditional to see a pitch deck and hard financial data, rather than a whitepaper and address to send Ethereum.  They mirror the growth in general Crowdfunding platforms like Kickstarter, though aren’t positioned for very small investors. Investors must fit specific criteria that ensure they are sophisticated enough to understand how investing works and/or have the net worth to do this safely. BnkToTheFuture is one example. To date, over $880 million has been invested by its users in crypto and fintech related projects including Kraken, Bitstamp and Bitfinex, all producing significant returns for early investors, though this doesn’t mean every investment will be a success.  With BnkToTheFuture (and platforms like it), investors’ funds are held in escrow, independent from the company and provisioned for investment in a pitch once it reaches its minimum funding goal. A range of payment methods are supported, and bank-grade security procedures (socket layers, 2FA) ensure investor confidence. As with any investment, there are significant risks and drawbacks: A return on investment will only be reached by private sale or public listing. The company could fold before that happens, meaning you lose your investment. Holding SPV shares doesn’t give you voting right. By investing, individuals are able to become an indirect shareholder in the startup or fund via a Special Purpose Vehicle (SPV) that holds their investment. Though the share of the SPV is essentially locked until the company is bought or publicly floated, there is a secondary market for the shares giving you an option to sell or, if you missed the investment period, buy-in. The Evolution of Crypto Investing - Early stage investment platforms essentially require the broad longterm approach to assessing value known as fundamental analysis which we discuss in detail in our section on trading crypto.They represent another step along the maturity path of crypto investing, which began with the mania of ICOs. Getting exposure to crypto outside of simply hodling or trading crypto is still relatively difficult. Many traditional investors don't want to get their hands dirty in this way, and would prefer to call their financial advisor or broker and ask them to find a fund or index to give indirect exposure. Right now there are limited opportunities to do that. Grayscale have been the trailblazer selling GBTC - the Grayscale Bitcoin Trust - which gives investors exposure to bitcoin price movement without owning it, but you need to be an accredited investor.The big turning point for crypto investing is likely to come from the approval of a US Exchange Traded Fund (ETF) which will enable a huge number of regular investors to get easy access to a fund that simply tracks Bitcoin or a crypto index. The SEC has rejected all ETF applications to date, but there are at least eight new submissions (at the time of writing) and Canada recently approved their first adding pressure on their neighbour, so watch this watch.Should a Bitcoin ETF be approved, it would signal a major milestone in the evolution of the ways  which you can earn crypto, putting it within the reach of pension funds and conservative investment houses, a far cry from that first Ethereum ICO. "
        },
        {
          "Earning from mining crypto": "Bitcoin mining is the process that creates new bitcoin, adding them to the total supply, which has a fixed limit of 21 million, expected to be reached in the year 2140. The first block - aka Genesis block - was mined on January, 3rd 2009, and since then at approximately 10 minute intervals, a new block has been added to the network. The miner who publishes a block to the network receives a reward, which currently stands at 6.25 BTC. Given the high value of bitcoin, it’s no surprise that competition to become the miner who discovers the next block and claims the reward, is so intense.To earn the right to broadcast the next block to the network and confirm the transactions contained within it, miners must use their computational power to solve a complex mathematical problem. This is why Bitcoin is known as a Proof of Work (PoW) cryptocurrency: because miners must prove that they have completed the computational work required to calculate the correct solution. While the calculation itself is meaningless, the work required to arrive there is not: it proves that the miner hasn’t cheated, and ensures that no single entity can discover all of the blocks and keep all the bitcoin rewards to themselves. Think of it like a lottery where adding more computer power is like buying more tickets. Your chances of winning - finding the correct solution - increase, but so does your outlay, in terms of electricity. To be a profitable miner, the rewards earned from successfully mined blocks, must be greater than the cost of energy consumed in the process. Miners also earn the transaction fees associated with the blocks they attempt to add to the blockchain, but those are of negligible value compared to 6.5 BTC reward. Solo mining – i.e. attempting to find new Bitcoin blocks using GPUs or ASICs that you control – is no longer profitable. Even with multiple ASICs linked together, you could toil away for weeks, months or longer and fail to discover a new block. In the meantime, you would be running up an expensive electricity bill, since these devices are power-hungry.  To solve this problem, and make mining more accessible to as many people as possible, bitcoiners have created mining pools. This entails a group of miners combining their hashpower (their collective computer processing power) to search for a new block together. If any miner in the pool succeeds in this quest, the coinbase reward will be shared with all pool members proportionately to their hashpower. For example, if you provide 5% of the hash power to the pool and the pool discovers a new block, you will receive 5% of the reward which (excluding pool fees) would amount to 0.3125 BTC. If you’re a tech geek who loves getting hands-on and learning more about how things work, cryptocurrency mining can be rewarding. Setting up your own bitcoin mining rig will teach you more about crypto than hundreds of hours of tutorials and textbooks could. From a knowledge perspective, then, mining could be worth a look. If you’re simply looking to earn a passive income from mining, and not attracted by the technical challenge, you are likely to struggle. In addition to requiring frequent monitoring and maintenance, mining is barely profitable for the average user, which is why the practice has largely been commoditised by professional companies that can leverage economies of scale. "
        }
      ]
    },
    {
      "section3": [
        {
          "Cryptocurrency Trading": "When we surveyed newcomers to cryptocurrency asking them what aspect they would most like to learn about, one of the most popular answers was how to trade cryptocurrency. This shouldn’t be a surprise. Cryptocurrency is an ideal asset to trade because its short-term price is volatile. In other words, price changes quickly and by significant amounts on a regular basis.A volatile asset presents a lot of opportunity for traders who make money by exploiting price movement; but trading cryptocurrency is a double-edged sword. Greater volatility means greater risk, and the risk to a novice trader of losing money is much greater than the chance of making money.Cryptocurrency is also a novel and relatively immature asset, which means that its true potential over the longer term is especially hard to predict. Early investors have enjoyed astronomical returns, and because adoption is still at a relatively low level, cryptocurrencies still present the possibility for significant returns relative to investment.Its novelty - especially in relation to its challenge to traditional forms of money - means its use case and legitimacy in the eyes of governments are unproven, and so there too, lies a lot of risk, to weigh against the opportunity. Though both Trading and Hodling require you to manage risk, it plays out over different time frames - short term and long term - and the influences on risk - how it manifests as price movement, and the approaches to managing it - are different for each.The umbrella term for analysing short-term asset price movement and volume of trading is Technical Analysis.Taking a much broader look at the influences on future success of the asset and measuring risk through factors that play out over a longer period of time is referred to as Fundamental Analysis.Fundamental and Technical Analysis can overlap, but they provide a useful framework for separating trading from investing. But both approaches still come down to measuring risk.So the basis of this section on learning how to trade cryptocurrency will start by looking at the decision making process: Technical Analysis - Understanding price and where it comes from; reading price data & price charts; interpreting historical trends; learning about volume & key price indicatorsFundamental Analysis - Understanding crypto's key adoption/performance/health metrics; price correlation with the wider economy; available adoption/price modelsRisk Management - how to measure risk; risk and trading size.Once you’ve understood the concepts around decision making, we’ll move on to execution:Making your first trade - Learning how to actually place a trade, based on your assessment, and the complexities around that.Advanced Trading Topics: Once you have learned the basics, we can introduce more complex and riskier trading tools which can increase your exposure through leverage or by speeding up the execution process through automation. Whether Trading or Hodling, you are essentially betting that you will be able to sell a cryptocurrency at a higher than the point at which you bought. You might flinch at use of the word ‘betting’ but trading is a form of gambling. The trick is reducing it to a skill-based decision - through a structured approach - and tilting the odds/risk in your favour. If you simply open an account with an exchange and place trades based on nothing but instinct, or a random tweet you read, it becomes a luck-based process. You may as well be flipping a coin, except that the odds will be against you (as will be explained) and you will almost certainly get burned.You can think of learning to trade like learning to play poker. You face a steep learning curve with the likelihood that the experienced players will take advantage of the novices. "
        },
        {
          "Crypto Price Charts": "At the most basic level, a bitcoin price chart is a line graph on two axes illustrating price history for bitcoin trades conducted between a specific pair of currencies. Bitcoin’s price is always relative to another specific currency, known simply as a Trading Pair. Trading pairs are offered against base currencies - currencies which are the most liquid. Given there are thousands of cryptocurrencies, enabling trading pairs between all of them and all FIAT currencies would be impractical, Instead exchanges offer trading against base currencies which are generally:Major Fiat currencies,Bitcoin,Ethereum,Major Stablecoins. The movement depicted in the chart is specific to this currency pair. BTC may be declining against USD but if ETH is declining faster against USD then BTC is increasing when paired with ETH.A simple line price chart gives the most basic indication of sentiment. As you can see from Bitcoin’s full price history, the peaks and troughs are associated with key events, as well key trends. At this scale, the chart is more relevant to Fundamental Analysis and Investing, remembering the distinction provided.In your quest to understand where price is going it's up to you to decide the time frame within which you want to operate, remembering the distinction between Trading - short term decision - and Investing - long term positions. Charts enable you to zoom out and look at the broadest possible time scale, or zoom in and focus on price change on a short term basis, aiding Technical Analysis. Within your chosen time-frame the bitcoin price charts tell a story of how the price has moved - its volatility - to provide a plot for your chosen scale. But to get a more detailed view of the price movement you need, chart that includes what’s known as Candlesticks (often abbreviate to just Candles) because that is what its shape resembles. With four key elements, the top and bottom of the candle body and a wick above and below.Through these four elements candles flesh out a simple line plot providing much more detailed information about what happened to price within a given chunk of time, rather than the single plot.Hopefully, as you digest this information you can start to appreciate the story candles are telling. The longer a candle the more price has moved during a period, the long the wicks the greater the range of movement, which can be described as Volatility.The more volatile a market is, the greater the opportunities to buy/sell and make a profit, but it is a double-edged sword, as the greater the risk. Volatility=risk. Looking at price movement with the aid of candles is the first step toward technical analysis, as they provide a first layer of detail of price signal and pattern. A successful trading strategy will interpret recognisable signals and patterns as being indicative of specific future price movement."
        },
        {
          "Leading & lagging indicatora": "As you start to decipher the world of cryptocurrency trading it might seem that you are overloaded with information and acronyms. At the basic level Learn Crypto’s section on how to trade cryptocurrency has made a distinction between Trading and Investing, based on short or long term focus, the different types of analysis generally used for each - Technical or Fundamental - and the level of commitment required.Technical Analysis is far more labour intensive simply because your focus is on short term patterns, and the constant flux of prices. As yet we haven’t even scratched the surface of the indicators and tools that you might employ. Rather than provide an overwhelming A-Z of every possible technical indicator, it is more helpful to understand how indicators can be grouped which can then help you find an affinity with a specific aspect of Technical or Fundamental Analysis. Technical indicators within trading of traditional financial assets - like shares or foreign exchange - are generally grouped as being Leading, Lagging or Macro. Common Leading & Lagging Indicators. We’ve already provided one example of each type of indicator. Relative Strength Index (RSI) is a leading indicator as it hints at whether the market is becoming overbought or oversold. Moving Averages, in contrast, rely on historic data and provide a continually updating retrospective view of average price behaviour.Crypto Specific Data Indicator. One of the difficulties of getting into Trading is the sheer amount of time required to understand the techniques used and find a successful strategy that might work. It is not particularly intuitive and there are some who doubt that Technical Analysis even works. Fortunately, there are different sources of information that can act as indicators to both short and long term price movement, which are less abstract, more intuitive and specific to cryptocurrency.. ransactional Data - If you were considering investing in your local coffee shop, one of the first things you’re going to want to look at is revenue. Total revenue is crucial but so would the daily patterns in revenue, relative growth rates week-on-week, and what types of coffee are being sold so you can create basic customer profiles.You can take a similar approach to analysing cryptocurrencies by pulling transactional data yourself - by running a node - or relying on existing services or analysts. Just taking Bitcoin as an example, there is a wealth of data that can act as leading indicators: Mining Data - Miners are the backbone of the Bitcoin network, their work - in running the hashing algorithm - literally secures the integrity of transactions. Mining is measured in Hashrate, so the logic goes that the higher the hashrate, the stronger Bitcoin is and the better it functions as a store of value. "
        },
        {
          "Crypto trading chats & patterns": "If you’ve followed the sequence of our knowledge base articles, explaining how to trade crypto, you should be familiar with the concept of technical analysis.  Technical Analysis uses crypto price history and volume -  visualising that data in trading charts - trying to predict where it will move next. Experienced traders do this by looking for any of a large number of recognised patterns which may point to specific subsequent price movement, as well as applying custom annotation to create their own interpretation. It is worth pointing out that trading charts and pattern recognition aren’t unique to crypto; it is fundamental to trading any asset, though the specifics may vary. In order to understand it, you must start by familiarising yourself with the tools that will enable you to annotate and draw charts. One of the most popular tools on the market is Tradingview. You can access the basic elements of Tradingview for free simply by visiting a cryptocurrency exchange such as Bitstamp. You’ll see the Tradeview option when you land on their homepage. Other similar tools are available. Date Ranges One of the most basic ways to filter data is by date range, which isn’t arbitrary. Looking at bitcoin’s price for the last day presents an entirely different perspective than the last five years.   As Technical Analysis generally - but not exclusively - focuses on short term positions, you’ll generally be focused on analysis within short timeframes. That isn’t where date consideration ends, because a standard trading view will utilise candlesticks - an explanation of candlestick charts is covered earlier in our knowledge base. They allow a trader to understand price context within specified periods, visualised through narrow vertical rectangles, with what look like wicks at the top and bottom - together resembling a candle. The wicks indicate price highs and lows, and the rectangle, price and open and close within the specified period. The colour of the wick tells you whether the price went up or down."
        }
      ]
    },
    {
      "section4": [
        {
          "Smart Contracts": "Expressed in computer code, Smart Contracts are how blockchains automatically execute an agreement between two parties without any intermediary. When the Smart Contract conditions are met, the supporting blockchain will execute the agreement for a fee, paid in the blockchain’s native cryptocurrency. The resulting transactions are cryptographically recorded on the blockchain and cannot be changed. To flesh out the high-level description of what a Smart Contract is and does, we can look at how Smart Contracts work on the Ethereum blockchain, highlight examples of Smart Contract use cases and outline the specific benefits that Smart Contracts provide. Though inspired by Bitcoin, which functions as a new form of money, Ethereum was designed with much greater ambition. It provides a foundational layer for any digital application that can be reduced to mathematics, programmable money being just one use case, with Ether serving as Ethereum’s native currency. This capability is known as being ‘Turing Complete’ and led to Ethereum’s description as the world’s computer. To provide this foundational layer, Ethereum has its own scripting language called Solidity, which is how Smart Contracts are written. The instructions are processed in a run-time environment known as the Ethereum Virtual Machine - the EVM for short. Smart Contract Use Case - Ethereum’s Turing Complete design means that anyone can write a Smart Contract, there is no submission or vetting process. Smart Contracts can create their own rules and ownership structures. Given that Ethereum also supports token standards, it is a blank canvas for new permissionless methods of generating and exchanging value. Benefit of Smart Contracts - Smart Contracts increase trust as they are open and transparent and not lodged with an intermediary. Anyone can review the code and the logic to understand what will happen if an account interacts with it. Reviewing Smart Contracts does, however, require technical know-how, and the creator of the Smart Contract won’t necessarily share their identity. Independent contract auditing is now a significant part of Smart Contract deployment. At the same time, there are also a growing number of off-the-shelf tools that can allow you to review Smart Contract function yourself. Smart Contracts are digital and based entirely on logical arguments; they can be executed automatically, saving both time and cost. With the added benefit of Ethereum’s composability, you can quickly build out connected Smart Contract based services like lego blocks. One of the fears of entering into any traditional agreement is whether the terms will be honoured and how you can check. With Smart Contracts, anyone can check the outputs using blockchain browsers like Etherscan. The nature of blockchains means that transactions are immutable - they cannot be changed - providing a great deal of reassurance and security. For the same reason, Smart Contract terns are secure and cannot be changed once committed to the EVM. But this is also a source of vulnerability, as we’ll now find out. The use of Smart Contracts is almost certainly going to accelerate. They are fundamental to the promise of delivering what is described as web3.0, an internet experience where users control their data and identity and the value they create online. Their creation will become simplified for an increasing range of tasks that involve digital agreement and value transfer. Still, given their vulnerabilities, we’re likely to see big improvements in Smart Contract auditing, new insurance products for protocol providers and users and more focus on blacklisting stolen funds."
        },
        {
          "Security, Wallets & Keys": "This section of Learn Crypto is focused solely on how to use crypto. If you find yourself asking why crypto works this way, follow the links provided, or simply read  the cryptocurrency basics section first. You may find the context helps. You’ll be reassured to know that using cryptocurrency is in many ways like using Euros or Dollars, or a payment service like Paypal. There are, however, some unique concepts and terms which you’ll need to become familiar with, which will help you navigate the different options for using cryptocurrency.. As already described, cryptocurrency is a new type of money, and like any other money, your top priority is keeping it safe. With the money you are familiar with there are a couple of ways of looking after it. Option 1 might mean a safe or vault, with a key or code that only you hold. Option 2 - allowing someone else to look after it - most likely means using a bank, who you trust to store it, but gives you convenient access via an account, and maybe an App. At this point it is important to understand exactly what is being custodied (looked after) as crypto is entirely digital, but its monetary units don't exist as files on your file or laptop.Seeds - Usable Versions Of Private Keys. It is unrealistic to remember the 64 character Private Key for every address holding cryptocurrency, as it is not uncommon to have multiple addresses, in the same way you might have multiple bank accounts with different details. Luckily wallet designs have evolved to solve this. Hierarchical Deterministic wallets - HD Wallets for short - can derive all Private Keys from one start point known as a Seed. A Seed is a string of between 12 and 24 unique phrases. You may also see a Seed referred to as a Recovery Phrase or Backup Phrase.  So the fundamental difference between custodial and non-custodial wallets is whether you ultimately have access to the private keys/seed or not, giving you control over the funds. Looking at a crypto wallet, you cannot tell whether it is custodial or non-custodial (you have full responsibility). The ‘custody’ part works in the background, but is central to security.  This is so important because there is no bank, which means no customer support. So if you take the responsibility for your funds and something goes wrong, there is no chat support or complaints process. Conversely, allowing a service to look after your funds puts a lot of faith in their security. Just as there is no safety net for you, there isn’t a fallback for the service looking after your Seed This is by design; cryptocurrency gives the individual power over their money, and as we know, with great power, comes great responsibility. With the concept of custody in mind, we can now look at the options for safely storing cryptocurrency, by looking at the types of cryptocurrency wallet. Crypto Wallet - A crypto wallet is a device for storing, sending and receiving cryptocurrency. Choosing a crypto wallet - As you are now familiar with the concept of custody we can take an initial look at the different types of crypto wallet, which are differentiated by custody along with two other concepts: 1) Hold/Cold Wallets - By default a Hot Wallet is connected to the internet, making it convenient for transacting but less secure. You may want a Hot Wallet for frequent transactions, and a Cold Wallet for hodling. In this way you can think of them as the equivalent of a current/checking account and a savings account. 2) Soft/Hard Wallets - Describing whether the wallet is simple software (like an App) or a physical (hard) device. "
        },
        {
          "Sending & Receiving Cryoto": "A Mobile crypto wallet is nothing to be scared of. It is just an app that you download from the App Store or Play Store. There is a wide selection of wallets to choose from, and as with any other app that you are considering downloading, it is worth looking at the reviews with the store - or externally - to get a sense of how good it is. Learn Crypto recommends you start with an easy to use, non-custodial Mobile/Web wallet like Blockchain.com, putting you in control of your all-important Private Keys and giving you access both on your phone and PC. But feel free to research and choose your own, the process will be similar, so long as it uses a Seed. DOWNLOADING YOUR FIRST CRYPTO WALLET -  To download your Blockchain wallet use the button below which will take you to the Apple Store or Playstore. Once the App has successfully downloaded to your phone you’ll need to create an account. CREATING AN ACCOUNT - Though your Blockchain wallet is non-custodial and decentralised, you will still have an account for added security and to enable you to access your funds via both a Mobile Wallet and Web wallet. This will require an email address and password. Be sure to use a strong password; if you use Gmail accept the strong password suggestion. MANAGING SEED - You’ll now be asked to either Print or write down the one piece of information that will enable you to recover your funds if lost: Your Seed.  This is a crucial step as your Blockchain wallet is non-custodial, putting you in control of your funds; that means security is your responsibility. If this doesn’t mean anything to you, read the first article in this section.  You may prefer a custodial wallet option - where the wallet provider is responsible for your funds - there are plenty to choose from. This guide is equally applicable, you just won’t need to back-up a Secret Phase, though understanding the process is useful knowledge.  BACKING UP YOUR SEED -  In the previous article we explained how control of your crypto boils down to control of something called a Private Key, a long alphanumeric string of characters. To make managing that crucial bit of data easier Mobile Wallets translate them into a Seed, essentially a collection of Secret Phrases. Blockchain.com uses 12 Secret phrases. When you are setting up the wallet you’ll be asked to make your own offline record of these.. Keep the numbering as shown as the phrases must be used in the correct order and are case sensitive. Once you’ve made your backup you’ll be prompted to Finish & Verify you’ve done it correctly by inputting a random selection of four phrases. This is the process you’ll need to go through if you cannot access your account e.g losing your phone or it stops working, and ensures you have made a record of them. BITCOIN BALANCE - All currencies have different denominations. A Dollar breaks down to 100 cents, the same with Euro; Cryptocurrency is no different. 1 BTC1,000 mBTC (millibitcoin), 1,000,000 μBTC (microbitcoin), 100,000,000 Sats (Satoshis). If you send money via your banking App you should always check with the intended recipient to make sure they received it. With crypto, that process is governed by Confirmations. Once a transaction is sent it will appear as Pending, until Confirmed. You can view the detail of Pending transactions."
        },
        {
          "How to buy Crypto": "So far we’ve explained how to safely store cryptocurrency, introducing the crypto wallet. We then moved on to how to make transactions - sending and receiving - before explaining what role an exchange plays in bringing buyers and sellers of cryptocurrency together. This article will now walk through the steps for how to buy cryptocurrency for the first time. We are going to use bitcoin for our example, though the steps are largely the same for other cryptocurrencies.We’ll be using Coinbase as the example exchange - a Centralised Exchange, as discussed in the previous article.. We have no relationship with Coinbase but feel they provide one of the easiest to follow customer journeys for the novice. Regardless of which exchange you choose, the process of buying for the first time will start with Sign Up/Security and Verification. The next part of the process - adding funds and buying - can either be combined into Instant Purchase - via debit/credit card - or separated by Linking your Bank Account, followed by the buying step. You’ll need to sign up for an account to buy cryptocurrency from a centralised exchange. You’ll have been through a similar sign up process countless times, though you’ll find that social sign-up - Google, Facebook or Twitter - isn’t generally available. The decision of what email address to use for Sign Up is an important security consideration. Unfortunately, hackers target crypto exchanges and their users. This shouldn’t put you off, but it is recommended that you either use a secure email address specifically for buying cryptocurrency - such as Protonmail - or you make sure the email account used has two-factor authentication and a strong password.You’ll generally need to show you control the email address used by clicking a link within a Verification Email - again, a standard online process. Once you’ve verified your email it is strongly recommended that you turn on Two-Factor Authentication for your Exchange Account using an app like Google Authenticator rather than an SMS service. ( We explore Security fully in article six). Once you have created an account and passed KYC, the simplest and quickest way to buy cryptocurrency is using a credit/debit card.This allows you to combine payment and purchase into one transaction. The convenience does however come at the expense of the higher fees for card purchases (see table 1).Pay close attention to any restrictions on credit card purchases; some card issuers prohibit crypto purchases, while certain exchanges only support 3D Secure cards and won’t accept pre-paid cards.. Cards are also a one-way payment method, you cannot generally withdraw to them. With Instant Buying you are purchasing at what is known as Market or Spot Price, in other words, whatever the price of the chosen cryptocurrency is at the exact time of purchase.If you want to time your purchase at a specific price, Instant Buying isn’t appropriate. We explore this is in greater detail in our section on how to trade cryptocurrency. The alternative to instantly buying cryptocurrency with a credit/debit card is to link your bank account directly with the exchange, and select it as the payment method. This takes slightly longer, but is cheaper and unlike using a debit/credit card, you can (in general) sell and withdraw the proceeds directly to your bank account (more detail on this in the next article). Which is certainly worth thinking about."
        },
        {
          "Crypto footprint": "Part of blockchains value is that they are permissionless. There is no central authority needed to facilitate and authorise transactions - instead it is the technology itself and its consensus mechanism that reaches agreement on the accuracy of transactions and to provide finality of settlement. The other critical aspect of blockchains is transparency. Anyone with an internet connection can access crypto transactions Many mistakenly believe that cryptocurrencies enable completely anonymous transactions, but this isn’t the case. Knowing just how crypto visibility works is a crucial part of the learning process. The absence of personal information doesn’t make you invisible-  Firstly, it is crucial to understand that the absence of personal information on blockchain transactions does not result in anonymity.For example, Bitcoin transactions move funds between addresses which are alphanumeric strings (containing no personal information) simply pointing to a location on the Bitcoin blockchain ledger. These addresses are recorded on-chain and are therefore visible to the public via any free explorer service such as Blockchain Explorer. Since addresses are publicly visible, they can be recorded, analysed and most importantly annotated - in other words other associated information can be assigned to them. For example, it is easy to build a directory of businesses tied to the deposit addresses they openly share. If that business is regulated - such as a centralised exchange - then the anonymous transaction can now be connected to your identity (via the proof of identity you submitted during registration) and the traditional financial system via the banking details you associate with your exchange account. So any authority that follows an anonymous transaction to a point that connects to your real-world identity will then have full visibility.Cryptocurrencies aren’t anonymous they are pseudonymous. Pseudonymity provides a level of privacy whilst still maintaining a level of accountability. Transactions don't include personal information, but as soon as they intersect with a regulated institution, your details become known by association. This level of visibility has given rise to the blockchain analysis industry. These analysis companies' customers range from crypto startups to governments, and they conduct big business with key players in the industry, having raised over $80 million in funding to date. The most prominent companies include Chainalysis, Elliptic and Whitestream. According to 82 records of federal procurement contracts reviewed by CoinDesk federal agencies have spent at least $10 million in American tax dollars on Chainalysis’ tools, services and training since Chainalysis was founded in 2015. The agencies include the FBI and ICE so it is clear that blockchain analysis is lucrative and has broad applications. Crypto analytics firms are effective at promoting the value in their services by publishing reports about crypto crime and significant successes. The perpetrators of the highly publicised Twitter hack in 2020 were quickly traced thanks to blockchain analytics. Unfortunately the vast amount of data that can be harvested from public blockchains won't necessarily be used to fight crime. Given the huge controversy around the exploitative nature of the data practices of big data firms - notably Facebook & Cambridge Analytica - we should expect blockchain data to be weaponised in a similar way. "
        }
      ]
    },
    {
      "section5": [
        {
          "Bitcoin Architecture": "Bitcoin is the first successful example of a trustless monetary system - one that has no need for a central authority, like the Federal Reserve or the European Central Bank. By learning how Bitcoin’s technical architecture achieves this - the functions and specific roles - you can discover the wide range of opportunities available to build within that unique ecosystem or be inspired to create your own cryptocurrency. To start, let’s look at the fundamental requirements of any monetary system, then compare that to Bitcoin’s unique architecture, and the functions that humans play alongside hardware and software. Existing monetary systems are known as fiat money. Fiat is a latin term that means 'by decree' and it is used to describe how currencies such as the US Dollar, Euro and Yen are created and managed. Since 1971 global currencies have only had value because the governments that issue them say so. They are not backed by any asset, such as gold - which was previously the case - and work on a trust-based model. Satoshi Nakamoto - Bitcoin’s creator - solved the Double Spend issue by creating a monetary system with fixed rules defined in computer code, not a government policy document. Those rules run as a piece of software across a distributed network of computers without hierarchy, permission or trust. No central authority enforces the rules; participants in the Bitcoin network follow them because of economic incentives provided for issuing Bitcoin at a predictable and unchangeable rate toward a maximum fixed supply. This removes the risk of monetary abuse and generates ongoing consensus on balances, solving the double spend problem. Satoshi Nakamoto encapsulated these functions in the original reference code he wrote in 2008.  The software has since been updated and is made available in a reference client, the most commonly used being Bitcoin Core. Bitcoin Core enables anyone with a modest computer set-up to join a network of Nodes fulfilling Bitcoin’s functions, as well as providing a bridge to those that want to build services to expand the ecosystem and user adoption. In the next article you’ll learn how the ways in which Nodes interact to make Bitcoin work. You’ll all begin to understand the opportunities for you to actively participate in running the Bitcoin ecosystem - by fulfilling one of those roles - as well as to maintain and improve the software and infrastructure that sits behind it. Our overview of Bitcoin’s architecture - and subsequent articles - excludes the complexities of exactly how the protocol works. If the use of hashing, elliptic-curve cryptography or peer-to-peer networks is your bag then there are ways to actively participate in maintaining and improving the Bitcoin Protocol."
        },
        {
          "Bitcoin Full Node play": "In the previous article in this section we looked at an overview of the architecture of Bitcoin as a decentralised monetary system running across a peer-to-peer network. Keeping things high-level, we split the architecture into two broad components. The rules that define how Bitcoin works as a monetary system, delivered as a piece of software and a hierarchy of network participants who run it. In this article we’ll flesh out more details of the essential system functions and then look at the first of the network participants - a Full Node. Full Nodes play a crucial role in fulfilling Bitcoin’s core functions and enabling others to connect to the network. By running Bitcoin Core anyone with a modest computer set-up and competence can become a Node on the Bitcoin’ network, helping fulfill the important functions, as well as providing a bridge to those that want to build services to expand the ecosystem and user adoption. The full Bitcoin Blockchain is currently over 350 GB but once the download is complete - known as Initial Blockchain Downloading (IBD) - you can start playing a direct role in supporting the Bitcoin ecosystem. Running a Full Node means maintaining a constantly updating record of the ledger of bitcoin transactions, known as the Bitcoin blockchain. This means there is a significant bandwidth requirement for running a Full Node. The bitcoin blockchain is, as its name suggests, a linked chain of historic bitcoin transactions recorded into successive timestamped blocks of data. This provides the accurate settlement history record that any monetary system requires. The blocks are bound together using timestamps and cryptographic hashes and are created (via the Mining process) at intervals of roughly 10 minutes, which adjusts its difficulty every two weeks to achieve that (detailed below). Each block of transactions has a hash to validate the integrity of the previous ensuring a sequential pattern of blocks called the blockchain. The first block in the Bitcoin network is called the Genesis block because it does not reference any previous block. Instead, it was hard-coded into the source code by Satoshi. Each block size is no bigger than 1MB, with a capacity to accommodate about 4,000 transactions (each transaction size is an average of 250 bytes). The size limitation is crucial to the objective of decentralisation because any increase in storage makes the IBD larger. Too big and it limits who can participate, which is the antithesis of openness and inclusivity. This will make more sense as we fill in the details of the system participants that produce blocks, validate and verify transactions. The complexity of the Bitcoin architecture is in ensuring nodes acts independently of each other while still maintaining a highly secure and anonymous network. Although not all cryptocurrencies follow the Bitcoin network architecture, it the first successful and currently largest cryptocurrency network, and has been used as a model for many subsequent cryptocurrencies, adapting its rules and functions. A Full Node validates any transaction sent to it as it includes a full copy of the Bitcoin blockchain - introduced above. Once a bitcoin transaction is sent to any node connected to the bitcoin network, the transaction will be validated by that node.  Bitcoin Core acts like a server which means all the nested functions - as listed above - can be accessed and controlled by the client. Full Nodes do this by using set commands in JSON-RPC (Remote Procedure Calls) format which are available across a whole range of languages. So chances are, if you have programming skills you can communicate with Bitcoin Core and build out functions. As an alternative to building and maintaining Bitcoin Core there are completely separate implementations of the Bitcoin Protocol, such as Libbitcoin, which act as collections of open source C++ libraries for building bitcoin applications."
        },
        {
          "Bitcoin minor play": "As the Bitcoin blockchain has a fixed block size of 1MB, it can only accommodate an average of seven transactions per second, so unconfirmed transactions sit in something called a Mempool, waiting for Miners to take over. Miners’ function is to watch the Mempool, waiting for these unconfirmed transactions, then package them into a candidate block;  every ten minutes, one of the candidate blocks is chosen to be added to the existing blockchain confirming (settling) all the transactions within it. Miners are paid for this settlement function with new bitcoin for every confirmed block. The first block - aka Genesis block - was mined on January, 3rd 2009, with a reward of 50BTC.mEver since, a new block has been added to the network at approximately 10 minute intervals, and every 210,000 blocks the reward miners receive halves. This roughly equates to a four year halving cycle and means the supply cap of 21 million bitcoin will be reached around 2140. At Bitcoin’s 2021 ATH price of $64,805 the reward rate of 6.25BTC amounts to over $420k paid per block, every ten minutes. The BTC that is awarded to the miner who confirms each new block is also known as the “coinbase reward” – a term which was later claimed by the cryptocurrency exchange of the same name. Given that Bitcoin’s value comes from the digital scarcity of its currency, and the way it ensures against double spend, the mining process has to be difficult and incentivise honest behaviour. This is achieved through something called Proof of Work (Pow). Full Nodes automatically adjust the difficulty of finding the solution to the puzzle - every 2,016 blocks - ensuring the required amount of computational power has been expended to ensure a new block is created every 10 minutes, regulating issuance in line with the maximum supply. The computational puzzle is in the form of a hashing algorithm called SHA256. This isn’t unique to Bitcoin, but is an external cryptographic standard, developed by the NSA. A hash is a unique one-way identifier for a digital record that enables privacy and security. Think of it as a randomising engine. You provide any input, like a password and the algorithm produces a random string of text and numbers (the hash) of uniform length. Change one letter of the input and you get a different hash and you cannot work back from the hash to know the password, but a unique input will always generate the same hash value. SHA256 - used for Bitcoin Mining - produces a hash that is 64 characters long, regardless of the size of the input; each character represents four bytes of data 64*4=256. Bitcoin mining is often described as a lottery because the task that Miners complete to show Proof of Work is arbitrary - it is just a clever way of regulating new block production and bitcoin issuance. The aim of the game is to hash specific details from the new block and previous block, to produce a separate numeric hash value that is less than or equal to something called the Target - given our Lottery analogy this is the winning number. The hashed block details are: version number, a timestamp, the hash from the previous block, the hash of something called the Merkle Root, a random number called a nonce, and a target hash. Today, Miners use specialist hardware, known as mining rigs, that use application-specific integrated circuits, or ASICs. These are computer processors that have been optimised to solve the maths problem that is at the heart of bitcoin mining. One of the most popular is the Antman S19j Pro Miner 100 TH/s made by Bitmain. "
        },
        {
          "Etherum Architecture": "Ethereum is a blockchain-based system where anyone can build and securely deploy any digital service without going through a formal, centralised approval process - such as getting an App added to Apple's App Store. Ethereum has been dubbed the ‘world computer’ as it enables permissionless access to a Turing Complete system that can process any request expressed in its bespoke programming language. Ethereum is a distributed computing network that rents out its processing power through something called the Ethereum Virtual Machine (often abbreviated to EVM). The Ethereum network consists of Nodes following a set of rules, the Ethereum Protocol, with the sole purpose of maintaining the correct state of the EVM, which includes Accounts holding Ether and Smart Contracts. Ethereum’s use of Proof of Work is planned to end in 2022, changing to Proof of Stake, in order to improve scalability and to address concerns around the environmental impact of Proof of Work mining. A separate Beacon Chain already exists, holding staked funds, which will eventually merge with the mainnet and apply a new consensus mechanism called Casper the Friendly Finality Gadget. Unlike Bitcoin, the supply of Ethereum is uncapped, growing via the reward of two ETH paid to Miners for producing new blocks. Transactions are paid for by the sender in something called Gas. By charging for the work done by the EVM it incentives the minimum amount of calculation and charges the sender. Gas is paid for in Gwei, which as a micro-unit of Ether makes fees much easier to represent. 1 ETH = 1,000,000,000 Gwei. The changes mean that a portion of the fees which are included in newly mined blocks are burned, rather than going to Miners. The objective is to burn enough ETH on a regular basis to decrease the supply, and turn into a deflationary coin. The Client Software is an implementation of the Ethereum Protocol, providing a formal specification for how the Ethereum network and blockchain functions. It is available in a variety of different languages and with different approaches to how it syncs with the rest of the network. The Ethereum Protocol is open source software so it doesn’t necessarily need to apply to the main the Ethereum network which is known as the Mainnet. There are different implementations for testing - Ropsten - or bespoke product applications (as shown in the table above). Each network operates independently so the balance and transaction history of an Ethereum account on the Mainnet will not apply to other networks. Users simply need to connect to the different networks within their wallets, such as MetaMask."
        }
      ]
    }
  ],
  "data": [
    {
      "What is cryptocurrency?": "Cryptocurrency is a new kind of internet money. You can use it to buy things online, and you can send it instantly to other users anywhere in the world, at very low cost, needing nothing more than a smartphone and an internet connection.As well as functioning as a new type of internet money, cryptocurrency is also a very popular form of investment, with eye-popping long-term appreciation. When the Bitcoin system launched, its currency, bitcoin, was pretty much worthless. It wasn’t until 2010, when someone paid 10,000 BTC for a couple of pizzas, that bitcoin began to give signs that it could be used as money. But is anyone using it as money? Yes, there are over 1 million active Bitcoin addresses (users) particularly those suffering from the hyperinflation mentioned earlier, which constantly reduces the purchasing power of their existing money and those looking for a strong store of value. (We explain how to measure Bitcoin adoption in a later article).Bitcoin’s design makes it impossible to freeze, seize, spend someone else’s coins, or to spend the same bitcoin twice. If you try to double-spend your coins, only one of the transactions will go through - any others will fail; Hopefully you’ve now understood in basic terms what cryptocurrency is, and how it tries to achieve the function of sound money. As the first cryptocurrency, Bitcoin’s design has opened up a new phase in our journey to find the best sound money, and this is just the start. You’ll discover in later lessons how Bitcoin is evolving and as more people understand it, new improvements and refinements are made. The final frontier for bitcoin is volatility. Even though its price and popularity are increasing, it is still susceptible to big swings in value because in truth Bitcoin is still in its infancy, so congratulations, you are early to the party. But as more and more people own (and use) it, there’s every reason to believe that cryptocurrency will become more stable over time, and prove to be the ultimate form of sound money."
    },
    {
      "Bitcoin, scarcity & trust in money": "In the previous article, you learned the definition and basic characteristics of a cryptocurrency - including the distinction between the money and the money system, and the role of cryptography. You also had a brief intro to the history and evolution of money up until Bitcoin. This should have given you a grasp on how cryptocurrencies - despite being entirely digital - can have value, the origins of the term “gold standard”, and the basic properties of what makes for sound money: durability, divisibility, fungibility, portability, recognisability and scarcity.While all forms of digital currency satisfy the first five reasonably well, it turns out it’s surprisingly hard to impose scarcity on any digital thing. This is crucially important because value comes from scarcity. Imagine if gold was as common as sand, or Da Vinci had produced 1 million exact copies of the Mona Lisa.The absence of digital scarcity is the biggest weakness of existing money; achieving it was arguably the biggest challenge for cryptocurrency. Explaining both, is our challenge here, and it begins by talking about the importance of money holding value.The importance of money holding value - Money is a metre/yardstick for measuring value. This aspect of money is taken for granted by everyone who participates in the economy by using it as a medium of exchange. All trade and economic activity relies on it - it’s like a universal language. And just like when we speak our own language, we don’t often stop and consider it; we just take it for granted. Can you imagine a world where a metre kept constantly changing? Science, engineering and almost all commerce would be impossible.The same goes for economic activity in a world where the value of money doesn’t hold. Even just buying a coffee would require both a lot of maths and a huge amount of risk, let alone more complex stuff like mortgages or insurance. The complexities of modern commerce would be impossible and we'd revert back to the simple credit system mentioned in the first article. Unlike the metre, however, which is a fixed, objective and universally agreed measurement that will never change, money’s value - its measurement - is subjective and therefore changes. The problem of trust in digital money. Money can only be useful (and sound) if the ledgers can be trusted to be accurate and honest, and if its supply is kept under control. This means unreasonable amounts of money won’t suddenly be created or destroyed, with consequential impact on its spending power.  So how do fiat currencies solve this today? Simple: the government manages money the ledger for its currency either directly, by controlling .physical money creation (minting) and managing and allowing the creation of credit/debit relationships between itself, banks and people. To do this the central bank licences a few select institutions (like banks and building societies) to keep ledgers of their own. The sum of the credit of all the records from the ledgers of all the banks of a country (including the central bank) is the total supply of that currency. "
    },
    {
      "How Bitcoin works": "Bitcoin was created by an individual (or group of individuals) who went by the alias of Satoshi Nakamoto. To this day, nobody knows (at least publicly) who Satoshi Nakamoto is - and that’s arguably their biggest legacy to the community. By vanishing into the ether soon after Bitcoin was robust enough, Nakamoto has done away with the first central point of failure. If gold had been “invented” by someone, that person would arguably hold great influence over their invention. If, moreover, that someone had kept a key that allowed them to control the gold economy, they would wield an ungodly amount of power.  They would also be vulnerable to pleas, bribes, legal action, punches in the face, and otherwise strong pressure to tweak their invention to benefit one party or another - perhaps a government, or the mafia. Either way, the entire system would be vulnerable at a central point. That’s not Bitcoin’s case. Also, there’s also no cult of personality around its creator, no one to dictate the rules unchecked. Bitcoin belongs to the world, and no single person or country has jurisdiction over it. Bitcoin's design. Bitcoin is many things, but we’ll focus on the design elements here.Firstly, Bitcoin is a peer-to-peer network of computers all following a set of rules and instructions (the Bitcoin protocol) for validating transactions and issuing new coins. Any computer running any software that respects these rules can participate in the Bitcoin network. These are called Bitcoin Nodes.Think of this protocol as the banking laws of a country. Any bank can operate, so long as they obey the laws. The difference is that the Bitcoin protocol is enforced by code, and not by courts - meaning it’s much more reliable.Second, Bitcoin has a ledger of all the transactions, called the Blockchain. Transactions are recorded in blocks, which are created at set intervals and connect to the previous block to create a chain.Lastly, there is the mechanism for adding blocks to the Blockchain and reaching agreement (consensus mechanism) that the transactions are valid, and the whole chain accurate. This is called Mining. How bitcoin mining works as an incentive. The solution introduced by Bitcoin to this age-old computing problem involves maths, competition, and economic rewards, and goes by the name of mining.Mining involves a competition for solving a complex mathematical problem, which takes on average 10 minutes and is adjusted every two weeks to account for current computing power. The winner gets to add the current block of transactions and receives a reward for their efforts (as we’ll explain below).The catch is, everyone can easily verify that the solution is right. If a miner cheats, all other participants will simply discard the block. A cheater would lose not just the reward, but also all the money spent in energy to mine that block. This combined loss far outweighs any expected profits,"
    },
    {
      "Bitcoin's limitation": "The Trilemma & the future Knowing that Bitcoin has limitations may feel a bit like realising your favourite Super Hero has a weakness, but this was always part of the design. On-chain bitcoin transactions are best suited for high value, infrequent payments; in other words, the Store of Value use case.From previous lessons we know that money must also function as a Medium of Exchange, and that is where solutions to the trilemma come in. With this context now in mind we can delve further into each of the potential solutions - Forks, Lightning Network and Ethereum - and how this relates to the wider cryptocurrency ecosystem with the huge range of coins and services that are emerging. Cryptocurrency fulfills all the characteristics of sound money.Bitcoin was the first, and most influential, cryptocurrency.Its creator was Satoshi Nakamoto - publishing its blueprint in 2008.  How Bitcoin works to achieve a digitally scarce form of money. The achievements of Bitcoin’s creator will likely be considered as important as the invention of the internet or personal computer. Not simply a new form of money, but an entirely new way of thinking about money.As ingenious as the Bitcoin whitepaper was, it wasn’t perfect. This problem is known as the Bitcoin trilemma; how to achieve the three core functions of an ideal cryptocurrency-  Security - Can it provide a secure, trustworthy & reliable monetary system, Scalability - Can it support increasing numbers of users with no compromise on speed or convenience ,Decentralisation - Can it continue to function without a central point of control,Understanding this trilemma will give you a better appreciation of the problems Bitcoin solves, as well as those things it isn’t an ideal solution for. "
    },
    {
      "Crypto's new frontiers": "In any discussion about the future of crypto, it is essential first to understand where the industry is at the current moment in time. There are three aspects to this: the blockchain space is young, moves fast, and interacts with other technologies. Cryptography has been around for a while. Much of the innovation around blockchain  is rooted in the cypherpunk movement of the 1990s. However, we must realise that blockchain was only invented and first applied in 2008/09. That’s only 12/13 years ago. To put this into perspective, the internet’s first application was in the 1970s when academia and military networks began using it to communicate and it took until the early 2000's for widespread usage to really take-off with expanding broadband and mobile penetration. The Spatial Web - Another important factor to consider is how quickly the industry is currently moving., The wider advancements in digital technology and communication, combined with  the nature of blockchain technology, mean the space tends to move incredibly fast. So fast that it can be very hard to keep up. Though blockchains are only a dozen years old, a huge amount has happened in that time. Ethereum and smart contract capability have led to the rise of entirely new industries and many companies - some of which have been legitimate innovators and haven’t. These industries include (and are not limited to) Defi, DAOs, NFTs and Digital identity. To assess the industry’s future, it will be useful to break it down into these key areas of innovation and see where they are likely to be heading.  The third and final important consideration is that the blockchain industry is not operating in a vacuum. Developments in Artificial Intelligence, Augmented and Virtual Reality, Internet of Things (think smart cars, robotics and biometrics), as well as 5G networks, 3d Printing and GPT-3 are all beginning to converge along with the blockchain space. NFTs, Supply Chains & Identity- Non-Fungible-Tokens or NFTs are a specific type of cryptographic token based on blockchain technology. In contrast to Bitcoin or other cryptocurrencies that are fungible - can be freely exchange for other tokens - NFTs represent something unique and are thus not mutually interchangeable. NFTs are used to create digital scarcity and power applications that facilitate the digital trade of art, collectables and other digital items. One famous case is the blockchain-based game ‘crypto kitties’. NFTs represent in-game assets controlled by the user (instead of the developer) and can be traded on third-party marketplaces. NFT collectible platforms are exploding, with individual examples changing hands for eye-watering sums. Banksy recently physically burned a piece of art - called Morons - then created an NFT from the live stream. It sold for $380,000. "
    },
    {
      "Earning crypto - risk vs reward?": "To get the most out of this section you’ll need a basic understanding of Bitcoin and how it works. Read this chapter first if you need to get up to speed. Economic incentives are central to how cryptocurrencies can function without a central point of control. The novel use of incentives also extends to how crypto projects attract new users, how those who own cryptocurrency are rewarded for retaining them, and the ways with which you can speculate with, and about the value of, crypto. We’ll use these three measures as yardsticks for you to evaluate the kinds of opportunities out there to earn cryptocurrency, but with the greatest emphasis on measuring risk. As a newcomer, understanding the risks involved, both explicit and implicit, is crucial. You cannot get something for nothing, and any opportunity that seems too good to be true, almost certainly is.  That being said, incentives - where you are compensated in crypto - are one of the main methods crypto projects use to attract new users. This is often simply in exchange for your attention, your time learning about a product or project, as well as promoting to others, the benefits of a new cryptocurrency. These things don’t require any up-front cost but understanding the implied cost of providing personal details, your time and effort - no matter how little - is crucial to realising that there really is no such thing as free cryptocurrency. As you’ll remember, cryptocurrency is a new type of internet money, creating trust and security without a central authority. One of the biggest earning opportunities, but with the greatest risk and complexity, is playing a direct part in running the system..  With Bitcoin, for example, there is no head office, it functions through a dispersed network that anyone can join - called Miners - providing computer power and getting paid bitcoin in return.  We’ll cover that topic last of all, as some of the ideas are complex and involve the greatest investment both in terms of time, money and risk, as well consideration. "
    },
    {
      "Crypto Myths": "If you commute into a city or a big town you’re probably used to being offered tasters of new products such as soft-drinks, shampoo or energy bars. It is a low-cost and effective alternative to online or TV marketing for a completely new product - putting it directly in the hands of a large number of consumers for free, hoping they like it and will buy it in the future. When Bitcoin launched - back in 2009 - it faced an extreme challenge in increasing adoption. It wasn’t just new, it was completely different to existing forms of money, had no company or individual behind it you could review, and no marketing budget. There were no cryptocurrency exchanges - the most popular way adoption grows today - so the only way to buy bitcoin was by sending funds to a miner willing to sell some of the coins they had earned as rewards. This was fine if you were comfortable with the risk of sending money to a stranger, but it was clear that in order to grow, Bitcoin needed an easier incentive system to build up its user base.It shouldn’t therefore be a surprise that attempts to spread the word involved putting bitcoin directly in potential users' hands (virtually speaking) just like the energy bar at a train station; this is how the bitcoin faucet was born. "
    },
    {
      "Learning & earning": "“Earn crypto while learning about crypto” is the simple slogan of the educational portal from cryptocurrency exchange Coinbase. In return for watching videos and taking quizzes on cryptocurrency projects whose tokens are listed on Coinbase, you can earn a small portion of that token. For example, you can earn $6 of MKR tokens for learning about how Maker works, and an impressive $50 of XLM for learning about Stellar. The table below shows that if you look at all the Learn and Earn courses Coinbase have ever supported and held on to the crypto rewards you have you would have made $460 as of January 18th 2022, with an aggregate price increase for all the coins rewarded of 58%.  Bear in mind that these figures will have come down since the All Time Highs hit by most cryptocurrencies in August 2021 but still show that with patience, you can earn significant sums of crypto over the long run just for learning about new projects. There’s another crypto-friendly company that allows you to earn cryptocurrency, and you may have heard of it: Brave, the web browser that has its own token called BAT. Brave is part of the attention economy which describes people giving their time to engage with content that brands would like them to see. Short for Basic Attention Token, BAT is rewarded to users who provide advertisers with their time by watching ads.  You don’t get paid for watching an advert on YouTube or Facebook, but on Brave it’s different. As Brave explains, when you turn on Brave Rewards within the browser, you can earn “frequent flier-like tokens for viewing privacy-respecting ads. You can set the number of ads you see per hour.Watching ads isn’t most people’s idea of fun, and you’re not going to get rich off watching ads every hour. However, the Brave Rewards program is well designed and integrated into the web browser, and will help you learn about cryptocurrency wallets, and ways to use them, as you browse. The user experience is superior to that provided by bitcoin faucets that also force you to watch ads."
    },
    {
      "Early stage investment": "In the early days of Bitcoin, the concept of “earning” from cryptocurrency was largely confined to mining. Miners – first individuals and later pools – received bitcoin as a reward for committing blocks of verified transactions to the blockchain. Fast-forward to the modern day and there are numerous ways to earn, from staking and trading to selling goods and services in exchange for cryptocurrency. Another way of gaining exposure to digital assets is via ICOs and investment platforms. ICOs – Initial Coin Offerings – are essentially crowdfunds that raise capital for new crypto-related startups. ICOs are crypto’s stripped-down version of the stock market’s IPOs (Initial Public Offering), wherein the shares of a private corporation are offered to the public in a new stock issuance.  In 2017, ICO mania gripped the industry as close to $5 billion was raised from investors queuing up to lay their hands on newly-created tokens. These intrepid investors were evidently hoping that their assets would – like Bitcoin – soar in value. Some did, many didn’t; ultimately the ICO bubble burst as crypto entered a protracted bear market. Investment Platforms Investment platforms offer a means by which investors can gain exposure to crypto companies as a shareholder, rather than simply holding a native cryptocurrency, and benefit from the success of the underlying business. This can make them more appealing to investors who prefer traditional to see a pitch deck and hard financial data, rather than a whitepaper and address to send Ethereum.  They mirror the growth in general Crowdfunding platforms like Kickstarter, though aren’t positioned for very small investors. Investors must fit specific criteria that ensure they are sophisticated enough to understand how investing works and/or have the net worth to do this safely. BnkToTheFuture is one example. To date, over $880 million has been invested by its users in crypto and fintech related projects including Kraken, Bitstamp and Bitfinex, all producing significant returns for early investors, though this doesn’t mean every investment will be a success.  With BnkToTheFuture (and platforms like it), investors’ funds are held in escrow, independent from the company and provisioned for investment in a pitch once it reaches its minimum funding goal. A range of payment methods are supported, and bank-grade security procedures (socket layers, 2FA) ensure investor confidence. As with any investment, there are significant risks and drawbacks: A return on investment will only be reached by private sale or public listing. The company could fold before that happens, meaning you lose your investment. Holding SPV shares doesn’t give you voting right. By investing, individuals are able to become an indirect shareholder in the startup or fund via a Special Purpose Vehicle (SPV) that holds their investment. Though the share of the SPV is essentially locked until the company is bought or publicly floated, there is a secondary market for the shares giving you an option to sell or, if you missed the investment period, buy-in. The Evolution of Crypto Investing - Early stage investment platforms essentially require the broad longterm approach to assessing value known as fundamental analysis which we discuss in detail in our section on trading crypto.They represent another step along the maturity path of crypto investing, which began with the mania of ICOs. Getting exposure to crypto outside of simply hodling or trading crypto is still relatively difficult. Many traditional investors don't want to get their hands dirty in this way, and would prefer to call their financial advisor or broker and ask them to find a fund or index to give indirect exposure. Right now there are limited opportunities to do that. Grayscale have been the trailblazer selling GBTC - the Grayscale Bitcoin Trust - which gives investors exposure to bitcoin price movement without owning it, but you need to be an accredited investor.The big turning point for crypto investing is likely to come from the approval of a US Exchange Traded Fund (ETF) which will enable a huge number of regular investors to get easy access to a fund that simply tracks Bitcoin or a crypto index. The SEC has rejected all ETF applications to date, but there are at least eight new submissions (at the time of writing) and Canada recently approved their first adding pressure on their neighbour, so watch this watch.Should a Bitcoin ETF be approved, it would signal a major milestone in the evolution of the ways  which you can earn crypto, putting it within the reach of pension funds and conservative investment houses, a far cry from that first Ethereum ICO. "
    },
    {
      "Earning from mining crypto": "Bitcoin mining is the process that creates new bitcoin, adding them to the total supply, which has a fixed limit of 21 million, expected to be reached in the year 2140. The first block - aka Genesis block - was mined on January, 3rd 2009, and since then at approximately 10 minute intervals, a new block has been added to the network. The miner who publishes a block to the network receives a reward, which currently stands at 6.25 BTC. Given the high value of bitcoin, it’s no surprise that competition to become the miner who discovers the next block and claims the reward, is so intense.To earn the right to broadcast the next block to the network and confirm the transactions contained within it, miners must use their computational power to solve a complex mathematical problem. This is why Bitcoin is known as a Proof of Work (PoW) cryptocurrency: because miners must prove that they have completed the computational work required to calculate the correct solution. While the calculation itself is meaningless, the work required to arrive there is not: it proves that the miner hasn’t cheated, and ensures that no single entity can discover all of the blocks and keep all the bitcoin rewards to themselves. Think of it like a lottery where adding more computer power is like buying more tickets. Your chances of winning - finding the correct solution - increase, but so does your outlay, in terms of electricity. To be a profitable miner, the rewards earned from successfully mined blocks, must be greater than the cost of energy consumed in the process. Miners also earn the transaction fees associated with the blocks they attempt to add to the blockchain, but those are of negligible value compared to 6.5 BTC reward. Solo mining – i.e. attempting to find new Bitcoin blocks using GPUs or ASICs that you control – is no longer profitable. Even with multiple ASICs linked together, you could toil away for weeks, months or longer and fail to discover a new block. In the meantime, you would be running up an expensive electricity bill, since these devices are power-hungry.  To solve this problem, and make mining more accessible to as many people as possible, bitcoiners have created mining pools. This entails a group of miners combining their hashpower (their collective computer processing power) to search for a new block together. If any miner in the pool succeeds in this quest, the coinbase reward will be shared with all pool members proportionately to their hashpower. For example, if you provide 5% of the hash power to the pool and the pool discovers a new block, you will receive 5% of the reward which (excluding pool fees) would amount to 0.3125 BTC. If you’re a tech geek who loves getting hands-on and learning more about how things work, cryptocurrency mining can be rewarding. Setting up your own bitcoin mining rig will teach you more about crypto than hundreds of hours of tutorials and textbooks could. From a knowledge perspective, then, mining could be worth a look. If you’re simply looking to earn a passive income from mining, and not attracted by the technical challenge, you are likely to struggle. In addition to requiring frequent monitoring and maintenance, mining is barely profitable for the average user, which is why the practice has largely been commoditised by professional companies that can leverage economies of scale. "
    },
    {
      "Cryptocurrency Trading": "When we surveyed newcomers to cryptocurrency asking them what aspect they would most like to learn about, one of the most popular answers was how to trade cryptocurrency. This shouldn’t be a surprise. Cryptocurrency is an ideal asset to trade because its short-term price is volatile. In other words, price changes quickly and by significant amounts on a regular basis.A volatile asset presents a lot of opportunity for traders who make money by exploiting price movement; but trading cryptocurrency is a double-edged sword. Greater volatility means greater risk, and the risk to a novice trader of losing money is much greater than the chance of making money.Cryptocurrency is also a novel and relatively immature asset, which means that its true potential over the longer term is especially hard to predict. Early investors have enjoyed astronomical returns, and because adoption is still at a relatively low level, cryptocurrencies still present the possibility for significant returns relative to investment.Its novelty - especially in relation to its challenge to traditional forms of money - means its use case and legitimacy in the eyes of governments are unproven, and so there too, lies a lot of risk, to weigh against the opportunity. Though both Trading and Hodling require you to manage risk, it plays out over different time frames - short term and long term - and the influences on risk - how it manifests as price movement, and the approaches to managing it - are different for each.The umbrella term for analysing short-term asset price movement and volume of trading is Technical Analysis.Taking a much broader look at the influences on future success of the asset and measuring risk through factors that play out over a longer period of time is referred to as Fundamental Analysis.Fundamental and Technical Analysis can overlap, but they provide a useful framework for separating trading from investing. But both approaches still come down to measuring risk.So the basis of this section on learning how to trade cryptocurrency will start by looking at the decision making process: Technical Analysis - Understanding price and where it comes from; reading price data & price charts; interpreting historical trends; learning about volume & key price indicatorsFundamental Analysis - Understanding crypto's key adoption/performance/health metrics; price correlation with the wider economy; available adoption/price modelsRisk Management - how to measure risk; risk and trading size.Once you’ve understood the concepts around decision making, we’ll move on to execution:Making your first trade - Learning how to actually place a trade, based on your assessment, and the complexities around that.Advanced Trading Topics: Once you have learned the basics, we can introduce more complex and riskier trading tools which can increase your exposure through leverage or by speeding up the execution process through automation. Whether Trading or Hodling, you are essentially betting that you will be able to sell a cryptocurrency at a higher than the point at which you bought. You might flinch at use of the word ‘betting’ but trading is a form of gambling. The trick is reducing it to a skill-based decision - through a structured approach - and tilting the odds/risk in your favour. If you simply open an account with an exchange and place trades based on nothing but instinct, or a random tweet you read, it becomes a luck-based process. You may as well be flipping a coin, except that the odds will be against you (as will be explained) and you will almost certainly get burned.You can think of learning to trade like learning to play poker. You face a steep learning curve with the likelihood that the experienced players will take advantage of the novices. "
    },
    {
      "Crypto Price Charts": "At the most basic level, a bitcoin price chart is a line graph on two axes illustrating price history for bitcoin trades conducted between a specific pair of currencies. Bitcoin’s price is always relative to another specific currency, known simply as a Trading Pair. Trading pairs are offered against base currencies - currencies which are the most liquid. Given there are thousands of cryptocurrencies, enabling trading pairs between all of them and all FIAT currencies would be impractical, Instead exchanges offer trading against base currencies which are generally:Major Fiat currencies,Bitcoin,Ethereum,Major Stablecoins. The movement depicted in the chart is specific to this currency pair. BTC may be declining against USD but if ETH is declining faster against USD then BTC is increasing when paired with ETH.A simple line price chart gives the most basic indication of sentiment. As you can see from Bitcoin’s full price history, the peaks and troughs are associated with key events, as well key trends. At this scale, the chart is more relevant to Fundamental Analysis and Investing, remembering the distinction provided.In your quest to understand where price is going it's up to you to decide the time frame within which you want to operate, remembering the distinction between Trading - short term decision - and Investing - long term positions. Charts enable you to zoom out and look at the broadest possible time scale, or zoom in and focus on price change on a short term basis, aiding Technical Analysis. Within your chosen time-frame the bitcoin price charts tell a story of how the price has moved - its volatility - to provide a plot for your chosen scale. But to get a more detailed view of the price movement you need, chart that includes what’s known as Candlesticks (often abbreviate to just Candles) because that is what its shape resembles. With four key elements, the top and bottom of the candle body and a wick above and below.Through these four elements candles flesh out a simple line plot providing much more detailed information about what happened to price within a given chunk of time, rather than the single plot.Hopefully, as you digest this information you can start to appreciate the story candles are telling. The longer a candle the more price has moved during a period, the long the wicks the greater the range of movement, which can be described as Volatility.The more volatile a market is, the greater the opportunities to buy/sell and make a profit, but it is a double-edged sword, as the greater the risk. Volatility=risk. Looking at price movement with the aid of candles is the first step toward technical analysis, as they provide a first layer of detail of price signal and pattern. A successful trading strategy will interpret recognisable signals and patterns as being indicative of specific future price movement."
    },
    {
      "Leading & lagging indicatora": "As you start to decipher the world of cryptocurrency trading it might seem that you are overloaded with information and acronyms. At the basic level Learn Crypto’s section on how to trade cryptocurrency has made a distinction between Trading and Investing, based on short or long term focus, the different types of analysis generally used for each - Technical or Fundamental - and the level of commitment required.Technical Analysis is far more labour intensive simply because your focus is on short term patterns, and the constant flux of prices. As yet we haven’t even scratched the surface of the indicators and tools that you might employ. Rather than provide an overwhelming A-Z of every possible technical indicator, it is more helpful to understand how indicators can be grouped which can then help you find an affinity with a specific aspect of Technical or Fundamental Analysis. Technical indicators within trading of traditional financial assets - like shares or foreign exchange - are generally grouped as being Leading, Lagging or Macro. Common Leading & Lagging Indicators. We’ve already provided one example of each type of indicator. Relative Strength Index (RSI) is a leading indicator as it hints at whether the market is becoming overbought or oversold. Moving Averages, in contrast, rely on historic data and provide a continually updating retrospective view of average price behaviour.Crypto Specific Data Indicator. One of the difficulties of getting into Trading is the sheer amount of time required to understand the techniques used and find a successful strategy that might work. It is not particularly intuitive and there are some who doubt that Technical Analysis even works. Fortunately, there are different sources of information that can act as indicators to both short and long term price movement, which are less abstract, more intuitive and specific to cryptocurrency.. ransactional Data - If you were considering investing in your local coffee shop, one of the first things you’re going to want to look at is revenue. Total revenue is crucial but so would the daily patterns in revenue, relative growth rates week-on-week, and what types of coffee are being sold so you can create basic customer profiles.You can take a similar approach to analysing cryptocurrencies by pulling transactional data yourself - by running a node - or relying on existing services or analysts. Just taking Bitcoin as an example, there is a wealth of data that can act as leading indicators: Mining Data - Miners are the backbone of the Bitcoin network, their work - in running the hashing algorithm - literally secures the integrity of transactions. Mining is measured in Hashrate, so the logic goes that the higher the hashrate, the stronger Bitcoin is and the better it functions as a store of value. "
    },
    {
      "Crypto trading chats & patterns": "If you’ve followed the sequence of our knowledge base articles, explaining how to trade crypto, you should be familiar with the concept of technical analysis.  Technical Analysis uses crypto price history and volume -  visualising that data in trading charts - trying to predict where it will move next. Experienced traders do this by looking for any of a large number of recognised patterns which may point to specific subsequent price movement, as well as applying custom annotation to create their own interpretation. It is worth pointing out that trading charts and pattern recognition aren’t unique to crypto; it is fundamental to trading any asset, though the specifics may vary. In order to understand it, you must start by familiarising yourself with the tools that will enable you to annotate and draw charts. One of the most popular tools on the market is Tradingview. You can access the basic elements of Tradingview for free simply by visiting a cryptocurrency exchange such as Bitstamp. You’ll see the Tradeview option when you land on their homepage. Other similar tools are available. Date Ranges One of the most basic ways to filter data is by date range, which isn’t arbitrary. Looking at bitcoin’s price for the last day presents an entirely different perspective than the last five years.   As Technical Analysis generally - but not exclusively - focuses on short term positions, you’ll generally be focused on analysis within short timeframes. That isn’t where date consideration ends, because a standard trading view will utilise candlesticks - an explanation of candlestick charts is covered earlier in our knowledge base. They allow a trader to understand price context within specified periods, visualised through narrow vertical rectangles, with what look like wicks at the top and bottom - together resembling a candle. The wicks indicate price highs and lows, and the rectangle, price and open and close within the specified period. The colour of the wick tells you whether the price went up or down."
    },
    {
      "Smart Contracts": "Expressed in computer code, Smart Contracts are how blockchains automatically execute an agreement between two parties without any intermediary. When the Smart Contract conditions are met, the supporting blockchain will execute the agreement for a fee, paid in the blockchain’s native cryptocurrency. The resulting transactions are cryptographically recorded on the blockchain and cannot be changed. To flesh out the high-level description of what a Smart Contract is and does, we can look at how Smart Contracts work on the Ethereum blockchain, highlight examples of Smart Contract use cases and outline the specific benefits that Smart Contracts provide. Though inspired by Bitcoin, which functions as a new form of money, Ethereum was designed with much greater ambition. It provides a foundational layer for any digital application that can be reduced to mathematics, programmable money being just one use case, with Ether serving as Ethereum’s native currency. This capability is known as being ‘Turing Complete’ and led to Ethereum’s description as the world’s computer. To provide this foundational layer, Ethereum has its own scripting language called Solidity, which is how Smart Contracts are written. The instructions are processed in a run-time environment known as the Ethereum Virtual Machine - the EVM for short. Smart Contract Use Case - Ethereum’s Turing Complete design means that anyone can write a Smart Contract, there is no submission or vetting process. Smart Contracts can create their own rules and ownership structures. Given that Ethereum also supports token standards, it is a blank canvas for new permissionless methods of generating and exchanging value. Benefit of Smart Contracts - Smart Contracts increase trust as they are open and transparent and not lodged with an intermediary. Anyone can review the code and the logic to understand what will happen if an account interacts with it. Reviewing Smart Contracts does, however, require technical know-how, and the creator of the Smart Contract won’t necessarily share their identity. Independent contract auditing is now a significant part of Smart Contract deployment. At the same time, there are also a growing number of off-the-shelf tools that can allow you to review Smart Contract function yourself. Smart Contracts are digital and based entirely on logical arguments; they can be executed automatically, saving both time and cost. With the added benefit of Ethereum’s composability, you can quickly build out connected Smart Contract based services like lego blocks. One of the fears of entering into any traditional agreement is whether the terms will be honoured and how you can check. With Smart Contracts, anyone can check the outputs using blockchain browsers like Etherscan. The nature of blockchains means that transactions are immutable - they cannot be changed - providing a great deal of reassurance and security. For the same reason, Smart Contract terns are secure and cannot be changed once committed to the EVM. But this is also a source of vulnerability, as we’ll now find out. The use of Smart Contracts is almost certainly going to accelerate. They are fundamental to the promise of delivering what is described as web3.0, an internet experience where users control their data and identity and the value they create online. Their creation will become simplified for an increasing range of tasks that involve digital agreement and value transfer. Still, given their vulnerabilities, we’re likely to see big improvements in Smart Contract auditing, new insurance products for protocol providers and users and more focus on blacklisting stolen funds."
    },
    {
      "Security, Wallets & Keys": "This section of Learn Crypto is focused solely on how to use crypto. If you find yourself asking why crypto works this way, follow the links provided, or simply read  the cryptocurrency basics section first. You may find the context helps. You’ll be reassured to know that using cryptocurrency is in many ways like using Euros or Dollars, or a payment service like Paypal. There are, however, some unique concepts and terms which you’ll need to become familiar with, which will help you navigate the different options for using cryptocurrency.. As already described, cryptocurrency is a new type of money, and like any other money, your top priority is keeping it safe. With the money you are familiar with there are a couple of ways of looking after it. Option 1 might mean a safe or vault, with a key or code that only you hold. Option 2 - allowing someone else to look after it - most likely means using a bank, who you trust to store it, but gives you convenient access via an account, and maybe an App. At this point it is important to understand exactly what is being custodied (looked after) as crypto is entirely digital, but its monetary units don't exist as files on your file or laptop.Seeds - Usable Versions Of Private Keys. It is unrealistic to remember the 64 character Private Key for every address holding cryptocurrency, as it is not uncommon to have multiple addresses, in the same way you might have multiple bank accounts with different details. Luckily wallet designs have evolved to solve this. Hierarchical Deterministic wallets - HD Wallets for short - can derive all Private Keys from one start point known as a Seed. A Seed is a string of between 12 and 24 unique phrases. You may also see a Seed referred to as a Recovery Phrase or Backup Phrase.  So the fundamental difference between custodial and non-custodial wallets is whether you ultimately have access to the private keys/seed or not, giving you control over the funds. Looking at a crypto wallet, you cannot tell whether it is custodial or non-custodial (you have full responsibility). The ‘custody’ part works in the background, but is central to security.  This is so important because there is no bank, which means no customer support. So if you take the responsibility for your funds and something goes wrong, there is no chat support or complaints process. Conversely, allowing a service to look after your funds puts a lot of faith in their security. Just as there is no safety net for you, there isn’t a fallback for the service looking after your Seed This is by design; cryptocurrency gives the individual power over their money, and as we know, with great power, comes great responsibility. With the concept of custody in mind, we can now look at the options for safely storing cryptocurrency, by looking at the types of cryptocurrency wallet. Crypto Wallet - A crypto wallet is a device for storing, sending and receiving cryptocurrency. Choosing a crypto wallet - As you are now familiar with the concept of custody we can take an initial look at the different types of crypto wallet, which are differentiated by custody along with two other concepts: 1) Hold/Cold Wallets - By default a Hot Wallet is connected to the internet, making it convenient for transacting but less secure. You may want a Hot Wallet for frequent transactions, and a Cold Wallet for hodling. In this way you can think of them as the equivalent of a current/checking account and a savings account. 2) Soft/Hard Wallets - Describing whether the wallet is simple software (like an App) or a physical (hard) device. "
    },
    {
      "Sending & Receiving Cryoto": "A Mobile crypto wallet is nothing to be scared of. It is just an app that you download from the App Store or Play Store. There is a wide selection of wallets to choose from, and as with any other app that you are considering downloading, it is worth looking at the reviews with the store - or externally - to get a sense of how good it is. Learn Crypto recommends you start with an easy to use, non-custodial Mobile/Web wallet like Blockchain.com, putting you in control of your all-important Private Keys and giving you access both on your phone and PC. But feel free to research and choose your own, the process will be similar, so long as it uses a Seed. DOWNLOADING YOUR FIRST CRYPTO WALLET -  To download your Blockchain wallet use the button below which will take you to the Apple Store or Playstore. Once the App has successfully downloaded to your phone you’ll need to create an account. CREATING AN ACCOUNT - Though your Blockchain wallet is non-custodial and decentralised, you will still have an account for added security and to enable you to access your funds via both a Mobile Wallet and Web wallet. This will require an email address and password. Be sure to use a strong password; if you use Gmail accept the strong password suggestion. MANAGING SEED - You’ll now be asked to either Print or write down the one piece of information that will enable you to recover your funds if lost: Your Seed.  This is a crucial step as your Blockchain wallet is non-custodial, putting you in control of your funds; that means security is your responsibility. If this doesn’t mean anything to you, read the first article in this section.  You may prefer a custodial wallet option - where the wallet provider is responsible for your funds - there are plenty to choose from. This guide is equally applicable, you just won’t need to back-up a Secret Phase, though understanding the process is useful knowledge.  BACKING UP YOUR SEED -  In the previous article we explained how control of your crypto boils down to control of something called a Private Key, a long alphanumeric string of characters. To make managing that crucial bit of data easier Mobile Wallets translate them into a Seed, essentially a collection of Secret Phrases. Blockchain.com uses 12 Secret phrases. When you are setting up the wallet you’ll be asked to make your own offline record of these.. Keep the numbering as shown as the phrases must be used in the correct order and are case sensitive. Once you’ve made your backup you’ll be prompted to Finish & Verify you’ve done it correctly by inputting a random selection of four phrases. This is the process you’ll need to go through if you cannot access your account e.g losing your phone or it stops working, and ensures you have made a record of them. BITCOIN BALANCE - All currencies have different denominations. A Dollar breaks down to 100 cents, the same with Euro; Cryptocurrency is no different. 1 BTC1,000 mBTC (millibitcoin), 1,000,000 μBTC (microbitcoin), 100,000,000 Sats (Satoshis). If you send money via your banking App you should always check with the intended recipient to make sure they received it. With crypto, that process is governed by Confirmations. Once a transaction is sent it will appear as Pending, until Confirmed. You can view the detail of Pending transactions."
    },
    {
      "How to buy Crypto": "So far we’ve explained how to safely store cryptocurrency, introducing the crypto wallet. We then moved on to how to make transactions - sending and receiving - before explaining what role an exchange plays in bringing buyers and sellers of cryptocurrency together. This article will now walk through the steps for how to buy cryptocurrency for the first time. We are going to use bitcoin for our example, though the steps are largely the same for other cryptocurrencies.We’ll be using Coinbase as the example exchange - a Centralised Exchange, as discussed in the previous article.. We have no relationship with Coinbase but feel they provide one of the easiest to follow customer journeys for the novice. Regardless of which exchange you choose, the process of buying for the first time will start with Sign Up/Security and Verification. The next part of the process - adding funds and buying - can either be combined into Instant Purchase - via debit/credit card - or separated by Linking your Bank Account, followed by the buying step. You’ll need to sign up for an account to buy cryptocurrency from a centralised exchange. You’ll have been through a similar sign up process countless times, though you’ll find that social sign-up - Google, Facebook or Twitter - isn’t generally available. The decision of what email address to use for Sign Up is an important security consideration. Unfortunately, hackers target crypto exchanges and their users. This shouldn’t put you off, but it is recommended that you either use a secure email address specifically for buying cryptocurrency - such as Protonmail - or you make sure the email account used has two-factor authentication and a strong password.You’ll generally need to show you control the email address used by clicking a link within a Verification Email - again, a standard online process. Once you’ve verified your email it is strongly recommended that you turn on Two-Factor Authentication for your Exchange Account using an app like Google Authenticator rather than an SMS service. ( We explore Security fully in article six). Once you have created an account and passed KYC, the simplest and quickest way to buy cryptocurrency is using a credit/debit card.This allows you to combine payment and purchase into one transaction. The convenience does however come at the expense of the higher fees for card purchases (see table 1).Pay close attention to any restrictions on credit card purchases; some card issuers prohibit crypto purchases, while certain exchanges only support 3D Secure cards and won’t accept pre-paid cards.. Cards are also a one-way payment method, you cannot generally withdraw to them. With Instant Buying you are purchasing at what is known as Market or Spot Price, in other words, whatever the price of the chosen cryptocurrency is at the exact time of purchase.If you want to time your purchase at a specific price, Instant Buying isn’t appropriate. We explore this is in greater detail in our section on how to trade cryptocurrency. The alternative to instantly buying cryptocurrency with a credit/debit card is to link your bank account directly with the exchange, and select it as the payment method. This takes slightly longer, but is cheaper and unlike using a debit/credit card, you can (in general) sell and withdraw the proceeds directly to your bank account (more detail on this in the next article). Which is certainly worth thinking about."
    },
    {
      "Crypto footprint": "Part of blockchains value is that they are permissionless. There is no central authority needed to facilitate and authorise transactions - instead it is the technology itself and its consensus mechanism that reaches agreement on the accuracy of transactions and to provide finality of settlement. The other critical aspect of blockchains is transparency. Anyone with an internet connection can access crypto transactions Many mistakenly believe that cryptocurrencies enable completely anonymous transactions, but this isn’t the case. Knowing just how crypto visibility works is a crucial part of the learning process. The absence of personal information doesn’t make you invisible-  Firstly, it is crucial to understand that the absence of personal information on blockchain transactions does not result in anonymity.For example, Bitcoin transactions move funds between addresses which are alphanumeric strings (containing no personal information) simply pointing to a location on the Bitcoin blockchain ledger. These addresses are recorded on-chain and are therefore visible to the public via any free explorer service such as Blockchain Explorer. Since addresses are publicly visible, they can be recorded, analysed and most importantly annotated - in other words other associated information can be assigned to them. For example, it is easy to build a directory of businesses tied to the deposit addresses they openly share. If that business is regulated - such as a centralised exchange - then the anonymous transaction can now be connected to your identity (via the proof of identity you submitted during registration) and the traditional financial system via the banking details you associate with your exchange account. So any authority that follows an anonymous transaction to a point that connects to your real-world identity will then have full visibility.Cryptocurrencies aren’t anonymous they are pseudonymous. Pseudonymity provides a level of privacy whilst still maintaining a level of accountability. Transactions don't include personal information, but as soon as they intersect with a regulated institution, your details become known by association. This level of visibility has given rise to the blockchain analysis industry. These analysis companies' customers range from crypto startups to governments, and they conduct big business with key players in the industry, having raised over $80 million in funding to date. The most prominent companies include Chainalysis, Elliptic and Whitestream. According to 82 records of federal procurement contracts reviewed by CoinDesk federal agencies have spent at least $10 million in American tax dollars on Chainalysis’ tools, services and training since Chainalysis was founded in 2015. The agencies include the FBI and ICE so it is clear that blockchain analysis is lucrative and has broad applications. Crypto analytics firms are effective at promoting the value in their services by publishing reports about crypto crime and significant successes. The perpetrators of the highly publicised Twitter hack in 2020 were quickly traced thanks to blockchain analytics. Unfortunately the vast amount of data that can be harvested from public blockchains won't necessarily be used to fight crime. Given the huge controversy around the exploitative nature of the data practices of big data firms - notably Facebook & Cambridge Analytica - we should expect blockchain data to be weaponised in a similar way. "
    },
    {
      "Bitcoin Architecture": "Bitcoin is the first successful example of a trustless monetary system - one that has no need for a central authority, like the Federal Reserve or the European Central Bank. By learning how Bitcoin’s technical architecture achieves this - the functions and specific roles - you can discover the wide range of opportunities available to build within that unique ecosystem or be inspired to create your own cryptocurrency. To start, let’s look at the fundamental requirements of any monetary system, then compare that to Bitcoin’s unique architecture, and the functions that humans play alongside hardware and software. Existing monetary systems are known as fiat money. Fiat is a latin term that means 'by decree' and it is used to describe how currencies such as the US Dollar, Euro and Yen are created and managed. Since 1971 global currencies have only had value because the governments that issue them say so. They are not backed by any asset, such as gold - which was previously the case - and work on a trust-based model. Satoshi Nakamoto - Bitcoin’s creator - solved the Double Spend issue by creating a monetary system with fixed rules defined in computer code, not a government policy document. Those rules run as a piece of software across a distributed network of computers without hierarchy, permission or trust. No central authority enforces the rules; participants in the Bitcoin network follow them because of economic incentives provided for issuing Bitcoin at a predictable and unchangeable rate toward a maximum fixed supply. This removes the risk of monetary abuse and generates ongoing consensus on balances, solving the double spend problem. Satoshi Nakamoto encapsulated these functions in the original reference code he wrote in 2008.  The software has since been updated and is made available in a reference client, the most commonly used being Bitcoin Core. Bitcoin Core enables anyone with a modest computer set-up to join a network of Nodes fulfilling Bitcoin’s functions, as well as providing a bridge to those that want to build services to expand the ecosystem and user adoption. In the next article you’ll learn how the ways in which Nodes interact to make Bitcoin work. You’ll all begin to understand the opportunities for you to actively participate in running the Bitcoin ecosystem - by fulfilling one of those roles - as well as to maintain and improve the software and infrastructure that sits behind it. Our overview of Bitcoin’s architecture - and subsequent articles - excludes the complexities of exactly how the protocol works. If the use of hashing, elliptic-curve cryptography or peer-to-peer networks is your bag then there are ways to actively participate in maintaining and improving the Bitcoin Protocol."
    },
    {
      "Bitcoin Full Node play": "In the previous article in this section we looked at an overview of the architecture of Bitcoin as a decentralised monetary system running across a peer-to-peer network. Keeping things high-level, we split the architecture into two broad components. The rules that define how Bitcoin works as a monetary system, delivered as a piece of software and a hierarchy of network participants who run it. In this article we’ll flesh out more details of the essential system functions and then look at the first of the network participants - a Full Node. Full Nodes play a crucial role in fulfilling Bitcoin’s core functions and enabling others to connect to the network. By running Bitcoin Core anyone with a modest computer set-up and competence can become a Node on the Bitcoin’ network, helping fulfill the important functions, as well as providing a bridge to those that want to build services to expand the ecosystem and user adoption. The full Bitcoin Blockchain is currently over 350 GB but once the download is complete - known as Initial Blockchain Downloading (IBD) - you can start playing a direct role in supporting the Bitcoin ecosystem. Running a Full Node means maintaining a constantly updating record of the ledger of bitcoin transactions, known as the Bitcoin blockchain. This means there is a significant bandwidth requirement for running a Full Node. The bitcoin blockchain is, as its name suggests, a linked chain of historic bitcoin transactions recorded into successive timestamped blocks of data. This provides the accurate settlement history record that any monetary system requires. The blocks are bound together using timestamps and cryptographic hashes and are created (via the Mining process) at intervals of roughly 10 minutes, which adjusts its difficulty every two weeks to achieve that (detailed below). Each block of transactions has a hash to validate the integrity of the previous ensuring a sequential pattern of blocks called the blockchain. The first block in the Bitcoin network is called the Genesis block because it does not reference any previous block. Instead, it was hard-coded into the source code by Satoshi. Each block size is no bigger than 1MB, with a capacity to accommodate about 4,000 transactions (each transaction size is an average of 250 bytes). The size limitation is crucial to the objective of decentralisation because any increase in storage makes the IBD larger. Too big and it limits who can participate, which is the antithesis of openness and inclusivity. This will make more sense as we fill in the details of the system participants that produce blocks, validate and verify transactions. The complexity of the Bitcoin architecture is in ensuring nodes acts independently of each other while still maintaining a highly secure and anonymous network. Although not all cryptocurrencies follow the Bitcoin network architecture, it the first successful and currently largest cryptocurrency network, and has been used as a model for many subsequent cryptocurrencies, adapting its rules and functions. A Full Node validates any transaction sent to it as it includes a full copy of the Bitcoin blockchain - introduced above. Once a bitcoin transaction is sent to any node connected to the bitcoin network, the transaction will be validated by that node.  Bitcoin Core acts like a server which means all the nested functions - as listed above - can be accessed and controlled by the client. Full Nodes do this by using set commands in JSON-RPC (Remote Procedure Calls) format which are available across a whole range of languages. So chances are, if you have programming skills you can communicate with Bitcoin Core and build out functions. As an alternative to building and maintaining Bitcoin Core there are completely separate implementations of the Bitcoin Protocol, such as Libbitcoin, which act as collections of open source C++ libraries for building bitcoin applications."
    },
    {
      "Bitcoin minor play": "As the Bitcoin blockchain has a fixed block size of 1MB, it can only accommodate an average of seven transactions per second, so unconfirmed transactions sit in something called a Mempool, waiting for Miners to take over. Miners’ function is to watch the Mempool, waiting for these unconfirmed transactions, then package them into a candidate block;  every ten minutes, one of the candidate blocks is chosen to be added to the existing blockchain confirming (settling) all the transactions within it. Miners are paid for this settlement function with new bitcoin for every confirmed block. The first block - aka Genesis block - was mined on January, 3rd 2009, with a reward of 50BTC.mEver since, a new block has been added to the network at approximately 10 minute intervals, and every 210,000 blocks the reward miners receive halves. This roughly equates to a four year halving cycle and means the supply cap of 21 million bitcoin will be reached around 2140. At Bitcoin’s 2021 ATH price of $64,805 the reward rate of 6.25BTC amounts to over $420k paid per block, every ten minutes. The BTC that is awarded to the miner who confirms each new block is also known as the “coinbase reward” – a term which was later claimed by the cryptocurrency exchange of the same name. Given that Bitcoin’s value comes from the digital scarcity of its currency, and the way it ensures against double spend, the mining process has to be difficult and incentivise honest behaviour. This is achieved through something called Proof of Work (Pow). Full Nodes automatically adjust the difficulty of finding the solution to the puzzle - every 2,016 blocks - ensuring the required amount of computational power has been expended to ensure a new block is created every 10 minutes, regulating issuance in line with the maximum supply. The computational puzzle is in the form of a hashing algorithm called SHA256. This isn’t unique to Bitcoin, but is an external cryptographic standard, developed by the NSA. A hash is a unique one-way identifier for a digital record that enables privacy and security. Think of it as a randomising engine. You provide any input, like a password and the algorithm produces a random string of text and numbers (the hash) of uniform length. Change one letter of the input and you get a different hash and you cannot work back from the hash to know the password, but a unique input will always generate the same hash value. SHA256 - used for Bitcoin Mining - produces a hash that is 64 characters long, regardless of the size of the input; each character represents four bytes of data 64*4=256. Bitcoin mining is often described as a lottery because the task that Miners complete to show Proof of Work is arbitrary - it is just a clever way of regulating new block production and bitcoin issuance. The aim of the game is to hash specific details from the new block and previous block, to produce a separate numeric hash value that is less than or equal to something called the Target - given our Lottery analogy this is the winning number. The hashed block details are: version number, a timestamp, the hash from the previous block, the hash of something called the Merkle Root, a random number called a nonce, and a target hash. Today, Miners use specialist hardware, known as mining rigs, that use application-specific integrated circuits, or ASICs. These are computer processors that have been optimised to solve the maths problem that is at the heart of bitcoin mining. One of the most popular is the Antman S19j Pro Miner 100 TH/s made by Bitmain. "
    },
    {
      "Etherum Architecture": "Ethereum is a blockchain-based system where anyone can build and securely deploy any digital service without going through a formal, centralised approval process - such as getting an App added to Apple's App Store. Ethereum has been dubbed the ‘world computer’ as it enables permissionless access to a Turing Complete system that can process any request expressed in its bespoke programming language. Ethereum is a distributed computing network that rents out its processing power through something called the Ethereum Virtual Machine (often abbreviated to EVM). The Ethereum network consists of Nodes following a set of rules, the Ethereum Protocol, with the sole purpose of maintaining the correct state of the EVM, which includes Accounts holding Ether and Smart Contracts. Ethereum’s use of Proof of Work is planned to end in 2022, changing to Proof of Stake, in order to improve scalability and to address concerns around the environmental impact of Proof of Work mining. A separate Beacon Chain already exists, holding staked funds, which will eventually merge with the mainnet and apply a new consensus mechanism called Casper the Friendly Finality Gadget. Unlike Bitcoin, the supply of Ethereum is uncapped, growing via the reward of two ETH paid to Miners for producing new blocks. Transactions are paid for by the sender in something called Gas. By charging for the work done by the EVM it incentives the minimum amount of calculation and charges the sender. Gas is paid for in Gwei, which as a micro-unit of Ether makes fees much easier to represent. 1 ETH = 1,000,000,000 Gwei. The changes mean that a portion of the fees which are included in newly mined blocks are burned, rather than going to Miners. The objective is to burn enough ETH on a regular basis to decrease the supply, and turn into a deflationary coin. The Client Software is an implementation of the Ethereum Protocol, providing a formal specification for how the Ethereum network and blockchain functions. It is available in a variety of different languages and with different approaches to how it syncs with the rest of the network. The Ethereum Protocol is open source software so it doesn’t necessarily need to apply to the main the Ethereum network which is known as the Mainnet. There are different implementations for testing - Ropsten - or bespoke product applications (as shown in the table above). Each network operates independently so the balance and transaction history of an Ethereum account on the Mainnet will not apply to other networks. Users simply need to connect to the different networks within their wallets, such as MetaMask."
    }
  ]
}
